; ModuleID = 'klu.c'
source_filename = "klu.c"
target datalayout = "e-m:o-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-apple-macosx10.14.0"

%struct.klu_common_struct = type { double, double, double, double, double, i32, i32, i32, i32 (i32, i32*, i32*, i32*, %struct.klu_common_struct*)*, i8*, i32, i32, i32, i32, i32, i32, i32, double, double, double, double, double, i64, i64 }

; Function Attrs: nounwind ssp uwtable
define i64 @klu_kernel_factor(i32, i32*, i32*, double*, i32*, double, double** nocapture, double*, i32*, i32*, i32*, i32*, i32*, i32*, i32*, double*, i32*, i32, i32*, double*, i32*, i32*, double*, %struct.klu_common_struct*) local_unnamed_addr #0 !dbg !20 {
  %25 = alloca double*, align 8
  call void @llvm.dbg.value(metadata i32 %0, metadata !58, metadata !DIExpression()), !dbg !96
  call void @llvm.dbg.value(metadata i32* %1, metadata !59, metadata !DIExpression()), !dbg !97
  call void @llvm.dbg.value(metadata i32* %2, metadata !60, metadata !DIExpression()), !dbg !98
  call void @llvm.dbg.value(metadata double* %3, metadata !61, metadata !DIExpression()), !dbg !99
  call void @llvm.dbg.value(metadata i32* %4, metadata !62, metadata !DIExpression()), !dbg !100
  call void @llvm.dbg.value(metadata double %5, metadata !63, metadata !DIExpression()), !dbg !101
  call void @llvm.dbg.value(metadata double** %6, metadata !64, metadata !DIExpression()), !dbg !102

!0 = distinct !DICompileUnit(language: DW_LANG_C99, file: !1, producer: "Apple LLVM version 10.0.0 (clang-1000.11.45.5)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !2, retainedTypes: !3)
!1 = !DIFile(filename: "klu.c", directory: "/Users/fak/Dropbox/Projects/SparsePerf/SparseSuite/SparseSuite")
!2 = !{}
!3 = !{!4, !5, !8, !9, !11, !14}
!4 = !DIBasicType(name: "double", size: 64, encoding: DW_ATE_float)
!5 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !6, size: 64)
!6 = !DIDerivedType(tag: DW_TAG_typedef, name: "Unit", file: !7, line: 253, baseType: !4)
!7 = !DIFile(filename: "./klu_version.h", directory: "/Users/fak/Dropbox/Projects/SparsePerf/SparseSuite/SparseSuite")
!8 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!9 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !10, size: 64)
!10 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!11 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !12, line: 62, baseType: !13)
!12 = !DIFile(filename: "/Applications/Xcode.app/Contents/Developer/Toolchains/XcodeDefault.xctoolchain/usr/lib/clang/10.0.0/include/stddef.h", directory: "/Users/fak/Dropbox/Projects/SparsePerf/SparseSuite/SparseSuite")
!13 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!14 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !4, size: 64)
!15 = !{i32 2, !"Dwarf Version", i32 4}
!16 = !{i32 2, !"Debug Info Version", i32 3}
!17 = !{i32 1, !"wchar_size", i32 4}
!18 = !{i32 7, !"PIC Level", i32 2}
!19 = !{!"Apple LLVM version 10.0.0 (clang-1000.11.45.5)"}
!20 = distinct !DISubprogram(name: "klu_kernel_factor", scope: !1, file: !1, line: 63, type: !21, isLocal: false, isDefinition: true, scopeLine: 100, flags: DIFlagPrototyped, isOptimized: true, unit: !0, variables: !57)
!21 = !DISubroutineType(types: !22)
!22 = !{!11, !10, !9, !9, !14, !9, !4, !23, !14, !9, !9, !9, !9, !9, !9, !9, !14, !9, !10, !9, !14, !9, !9, !14, !24}
!23 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !5, size: 64)
!24 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !25, size: 64)
!25 = !DIDerivedType(tag: DW_TAG_typedef, name: "klu_common", file: !26, line: 207, baseType: !27)
!26 = !DIFile(filename: "./klu.h", directory: "/Users/fak/Dropbox/Projects/SparsePerf/SparseSuite/SparseSuite")
!27 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "klu_common_struct", file: !26, line: 137, size: 1280, elements: !28)
!28 = !{!29, !30, !31, !32, !33, !34, !35, !36, !37, !42, !43, !44, !45, !46, !47, !48, !49, !50, !51, !52, !53, !54, !55, !56}
!29 = !DIDerivedType(tag: DW_TAG_member, name: "tol", scope: !27, file: !26, line: 144, baseType: !4, size: 64)
!30 = !DIDerivedType(tag: DW_TAG_member, name: "memgrow", scope: !27, file: !26, line: 145, baseType: !4, size: 64, offset: 64)
!31 = !DIDerivedType(tag: DW_TAG_member, name: "initmem_amd", scope: !27, file: !26, line: 146, baseType: !4, size: 64, offset: 128)
!32 = !DIDerivedType(tag: DW_TAG_member, name: "initmem", scope: !27, file: !26, line: 147, baseType: !4, size: 64, offset: 192)
!33 = !DIDerivedType(tag: DW_TAG_member, name: "maxwork", scope: !27, file: !26, line: 148, baseType: !4, size: 64, offset: 256)
!34 = !DIDerivedType(tag: DW_TAG_member, name: "btf", scope: !27, file: !26, line: 150, baseType: !10, size: 32, offset: 320)
!35 = !DIDerivedType(tag: DW_TAG_member, name: "ordering", scope: !27, file: !26, line: 151, baseType: !10, size: 32, offset: 352)
!36 = !DIDerivedType(tag: DW_TAG_member, name: "scale", scope: !27, file: !26, line: 153, baseType: !10, size: 32, offset: 384)
!37 = !DIDerivedType(tag: DW_TAG_member, name: "user_order", scope: !27, file: !26, line: 157, baseType: !38, size: 64, offset: 448)
!38 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !39, size: 64)
!39 = !DISubroutineType(types: !40)
!40 = !{!10, !10, !9, !9, !9, !41}
!41 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !27, size: 64)
!42 = !DIDerivedType(tag: DW_TAG_member, name: "user_data", scope: !27, file: !26, line: 162, baseType: !8, size: 64, offset: 512)
!43 = !DIDerivedType(tag: DW_TAG_member, name: "halt_if_singular", scope: !27, file: !26, line: 164, baseType: !10, size: 32, offset: 576)
!44 = !DIDerivedType(tag: DW_TAG_member, name: "status", scope: !27, file: !26, line: 177, baseType: !10, size: 32, offset: 608)
!45 = !DIDerivedType(tag: DW_TAG_member, name: "nrealloc", scope: !27, file: !26, line: 178, baseType: !10, size: 32, offset: 640)
!46 = !DIDerivedType(tag: DW_TAG_member, name: "structural_rank", scope: !27, file: !26, line: 180, baseType: !10, size: 32, offset: 672)
!47 = !DIDerivedType(tag: DW_TAG_member, name: "numerical_rank", scope: !27, file: !26, line: 185, baseType: !10, size: 32, offset: 704)
!48 = !DIDerivedType(tag: DW_TAG_member, name: "singular_col", scope: !27, file: !26, line: 191, baseType: !10, size: 32, offset: 736)
!49 = !DIDerivedType(tag: DW_TAG_member, name: "noffdiag", scope: !27, file: !26, line: 196, baseType: !10, size: 32, offset: 768)
!50 = !DIDerivedType(tag: DW_TAG_member, name: "flops", scope: !27, file: !26, line: 198, baseType: !4, size: 64, offset: 832)
!51 = !DIDerivedType(tag: DW_TAG_member, name: "rcond", scope: !27, file: !26, line: 199, baseType: !4, size: 64, offset: 896)
!52 = !DIDerivedType(tag: DW_TAG_member, name: "condest", scope: !27, file: !26, line: 200, baseType: !4, size: 64, offset: 960)
!53 = !DIDerivedType(tag: DW_TAG_member, name: "rgrowth", scope: !27, file: !26, line: 201, baseType: !4, size: 64, offset: 1024)
!54 = !DIDerivedType(tag: DW_TAG_member, name: "work", scope: !27, file: !26, line: 202, baseType: !4, size: 64, offset: 1088)
!55 = !DIDerivedType(tag: DW_TAG_member, name: "memusage", scope: !27, file: !26, line: 204, baseType: !11, size: 64, offset: 1152)
!56 = !DIDerivedType(tag: DW_TAG_member, name: "mempeak", scope: !27, file: !26, line: 205, baseType: !11, size: 64, offset: 1216)
!57 = !{!58, !59, !60, !61, !62, !63, !64, !65, !66, !67, !68, !69, !70, !71, !72, !73, !74, !75, !76, !77, !78, !79, !80, !81, !82, !83, !84, !85, !86, !87, !88, !89, !90, !91, !92, !93, !94, !95}
!58 = !DILocalVariable(name: "n", arg: 1, scope: !20, file: !1, line: 66, type: !10)
!59 = !DILocalVariable(name: "Ap", arg: 2, scope: !20, file: !1, line: 67, type: !9)
!60 = !DILocalVariable(name: "Ai", arg: 3, scope: !20, file: !1, line: 68, type: !9)
!61 = !DILocalVariable(name: "Ax", arg: 4, scope: !20, file: !1, line: 69, type: !14)
!62 = !DILocalVariable(name: "Q", arg: 5, scope: !20, file: !1, line: 70, type: !9)
!63 = !DILocalVariable(name: "Lsize", arg: 6, scope: !20, file: !1, line: 71, type: !4)
!64 = !DILocalVariable(name: "p_LU", arg: 7, scope: !20, file: !1, line: 74, type: !23)
!65 = !DILocalVariable(name: "Udiag", arg: 8, scope: !20, file: !1, line: 75, type: !14)
!66 = !DILocalVariable(name: "Llen", arg: 9, scope: !20, file: !1, line: 76, type: !9)
!67 = !DILocalVariable(name: "Ulen", arg: 10, scope: !20, file: !1, line: 77, type: !9)
!68 = !DILocalVariable(name: "Lip", arg: 11, scope: !20, file: !1, line: 78, type: !9)
!69 = !DILocalVariable(name: "Uip", arg: 12, scope: !20, file: !1, line: 79, type: !9)
!70 = !DILocalVariable(name: "P", arg: 13, scope: !20, file: !1, line: 80, type: !9)
!71 = !DILocalVariable(name: "lnz", arg: 14, scope: !20, file: !1, line: 81, type: !9)
!72 = !DILocalVariable(name: "unz", arg: 15, scope: !20, file: !1, line: 82, type: !9)
!73 = !DILocalVariable(name: "X", arg: 16, scope: !20, file: !1, line: 85, type: !14)
!74 = !DILocalVariable(name: "Work", arg: 17, scope: !20, file: !1, line: 86, type: !9)
!75 = !DILocalVariable(name: "k1", arg: 18, scope: !20, file: !1, line: 89, type: !10)
!76 = !DILocalVariable(name: "PSinv", arg: 19, scope: !20, file: !1, line: 90, type: !9)
!77 = !DILocalVariable(name: "Rs", arg: 20, scope: !20, file: !1, line: 91, type: !14)
!78 = !DILocalVariable(name: "Offp", arg: 21, scope: !20, file: !1, line: 94, type: !9)
!79 = !DILocalVariable(name: "Offi", arg: 22, scope: !20, file: !1, line: 95, type: !9)
!80 = !DILocalVariable(name: "Offx", arg: 23, scope: !20, file: !1, line: 96, type: !14)
!81 = !DILocalVariable(name: "Common", arg: 24, scope: !20, file: !1, line: 98, type: !24)
!82 = !DILocalVariable(name: "maxlnz", scope: !20, file: !1, line: 101, type: !4)
!83 = !DILocalVariable(name: "dunits", scope: !20, file: !1, line: 101, type: !4)
!84 = !DILocalVariable(name: "LU", scope: !20, file: !1, line: 102, type: !5)
!85 = !DILocalVariable(name: "Pinv", scope: !20, file: !1, line: 103, type: !9)
!86 = !DILocalVariable(name: "Lpend", scope: !20, file: !1, line: 103, type: !9)
!87 = !DILocalVariable(name: "Stack", scope: !20, file: !1, line: 103, type: !9)
!88 = !DILocalVariable(name: "Flag", scope: !20, file: !1, line: 103, type: !9)
!89 = !DILocalVariable(name: "Ap_pos", scope: !20, file: !1, line: 103, type: !9)
!90 = !DILocalVariable(name: "W", scope: !20, file: !1, line: 103, type: !9)
!91 = !DILocalVariable(name: "lsize", scope: !20, file: !1, line: 104, type: !10)
!92 = !DILocalVariable(name: "usize", scope: !20, file: !1, line: 104, type: !10)
!93 = !DILocalVariable(name: "anz", scope: !20, file: !1, line: 104, type: !10)
!94 = !DILocalVariable(name: "ok", scope: !20, file: !1, line: 104, type: !10)
!95 = !DILocalVariable(name: "lusize", scope: !20, file: !1, line: 105, type: !11)
!96 = !DILocation(line: 66, column: 9, scope: !20)
!97 = !DILocation(line: 67, column: 9, scope: !20)
!98 = !DILocation(line: 68, column: 9, scope: !20)
!99 = !DILocation(line: 69, column: 11, scope: !20)
!100 = !DILocation(line: 70, column: 9, scope: !20)
!101 = !DILocation(line: 71, column: 12, scope: !20)
!102 = !DILocation(line: 74, column: 12, scope: !20)
!103 = !DILocation(line: 75, column: 11, scope: !20)
!104 = !DILocation(line: 76, column: 9, scope: !20)
