; ModuleID = 'klu_analyze.c'
source_filename = "klu_analyze.c"
target datalayout = "e-m:o-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-apple-macosx10.14.0"

%struct.klu_symbolic = type { double, double, double, double, double*, i32, i32, i32*, i32*, i32*, i32, i32, i32, i32, i32, i32 }
%struct.klu_common_struct = type { double, double, double, double, double, i32, i32, i32, i32 (i32, i32*, i32*, i32*, %struct.klu_common_struct*)*, i8*, i32, i32, i32, i32, i32, i32, i32, double, double, double, double, double, i64, i64 }

; Function Attrs: nounwind ssp uwtable
define %struct.klu_symbolic* @klu_analyze(i32, i32*, i32*, %struct.klu_common_struct*) local_unnamed_addr #0 !dbg !11 {
  call void @llvm.dbg.value(metadata i32 %0, metadata !74, metadata !DIExpression()), !dbg !78
  call void @llvm.dbg.value(metadata i32* %1, metadata !75, metadata !DIExpression()), !dbg !79
  call void @llvm.dbg.value(metadata i32* %2, metadata !76, metadata !DIExpression()), !dbg !80
  call void @llvm.dbg.value(metadata %struct.klu_common_struct* %3, metadata !77, metadata !DIExpression()), !dbg !81
  %5 = icmp eq %struct.klu_common_struct* %3, null, !dbg !82
  br i1 %5, label %16, label %6, !dbg !84

; <label>:6:                                      ; preds = %4
  %7 = getelementptr inbounds %struct.klu_common_struct, %struct.klu_common_struct* %3, i64 0, i32 11, !dbg !85
  store i32 0, i32* %7, align 4, !dbg !86, !tbaa !87

!0 = distinct !DICompileUnit(language: DW_LANG_C99, file: !1, producer: "Apple LLVM version 10.0.0 (clang-1000.11.45.5)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !2, retainedTypes: !3)
!1 = !DIFile(filename: "klu_analyze.c", directory: "/Users/fak/Dropbox/Projects/SparsePerf/SparseSuite/SparseSuite")
!2 = !{}
!3 = !{!4, !5}
!4 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!5 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!6 = !{i32 2, !"Dwarf Version", i32 4}
!7 = !{i32 2, !"Debug Info Version", i32 3}
!8 = !{i32 1, !"wchar_size", i32 4}
!9 = !{i32 7, !"PIC Level", i32 2}
!10 = !{!"Apple LLVM version 10.0.0 (clang-1000.11.45.5)"}
!11 = distinct !DISubprogram(name: "klu_analyze", scope: !1, file: !1, line: 445, type: !12, isLocal: false, isDefinition: true, scopeLine: 455, flags: DIFlagPrototyped, isOptimized: true, unit: !0, variables: !73)
!12 = !DISubroutineType(types: !13)
!13 = !{!14, !5, !29, !29, !38}
!14 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !15, size: 64)
!15 = !DIDerivedType(tag: DW_TAG_typedef, name: "klu_symbolic", file: !16, line: 54, baseType: !17)
!16 = !DIFile(filename: "./klu.h", directory: "/Users/fak/Dropbox/Projects/SparsePerf/SparseSuite/SparseSuite")
!17 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !16, line: 23, size: 768, elements: !18)
!18 = !{!19, !21, !22, !23, !24, !26, !27, !28, !30, !31, !32, !33, !34, !35, !36, !37}
!19 = !DIDerivedType(tag: DW_TAG_member, name: "symmetry", scope: !17, file: !16, line: 31, baseType: !20, size: 64)
!20 = !DIBasicType(name: "double", size: 64, encoding: DW_ATE_float)
!21 = !DIDerivedType(tag: DW_TAG_member, name: "est_flops", scope: !17, file: !16, line: 32, baseType: !20, size: 64, offset: 64)
!22 = !DIDerivedType(tag: DW_TAG_member, name: "lnz", scope: !17, file: !16, line: 33, baseType: !20, size: 64, offset: 128)
!23 = !DIDerivedType(tag: DW_TAG_member, name: "unz", scope: !17, file: !16, line: 33, baseType: !20, size: 64, offset: 192)
!24 = !DIDerivedType(tag: DW_TAG_member, name: "Lnz", scope: !17, file: !16, line: 34, baseType: !25, size: 64, offset: 256)
!25 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !20, size: 64)
!26 = !DIDerivedType(tag: DW_TAG_member, name: "n", scope: !17, file: !16, line: 38, baseType: !5, size: 32, offset: 320)
!27 = !DIDerivedType(tag: DW_TAG_member, name: "nz", scope: !17, file: !16, line: 39, baseType: !5, size: 32, offset: 352)
!28 = !DIDerivedType(tag: DW_TAG_member, name: "P", scope: !17, file: !16, line: 40, baseType: !29, size: 64, offset: 384)
!29 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !5, size: 64)
!30 = !DIDerivedType(tag: DW_TAG_member, name: "Q", scope: !17, file: !16, line: 41, baseType: !29, size: 64, offset: 448)
!31 = !DIDerivedType(tag: DW_TAG_member, name: "R", scope: !17, file: !16, line: 42, baseType: !29, size: 64, offset: 512)
!32 = !DIDerivedType(tag: DW_TAG_member, name: "nzoff", scope: !17, file: !16, line: 43, baseType: !5, size: 32, offset: 576)
!33 = !DIDerivedType(tag: DW_TAG_member, name: "nblocks", scope: !17, file: !16, line: 44, baseType: !5, size: 32, offset: 608)
!34 = !DIDerivedType(tag: DW_TAG_member, name: "maxblock", scope: !17, file: !16, line: 45, baseType: !5, size: 32, offset: 640)
!35 = !DIDerivedType(tag: DW_TAG_member, name: "ordering", scope: !17, file: !16, line: 46, baseType: !5, size: 32, offset: 672)
!36 = !DIDerivedType(tag: DW_TAG_member, name: "do_btf", scope: !17, file: !16, line: 47, baseType: !5, size: 32, offset: 704)
!37 = !DIDerivedType(tag: DW_TAG_member, name: "structural_rank", scope: !17, file: !16, line: 50, baseType: !5, size: 32, offset: 736)
!38 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !39, size: 64)
!39 = !DIDerivedType(tag: DW_TAG_typedef, name: "klu_common", file: !16, line: 207, baseType: !40)
!40 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "klu_common_struct", file: !16, line: 137, size: 1280, elements: !41)
!41 = !{!42, !43, !44, !45, !46, !47, !48, !49, !50, !55, !56, !57, !58, !59, !60, !61, !62, !63, !64, !65, !66, !67, !68, !72}
!42 = !DIDerivedType(tag: DW_TAG_member, name: "tol", scope: !40, file: !16, line: 144, baseType: !20, size: 64)
!43 = !DIDerivedType(tag: DW_TAG_member, name: "memgrow", scope: !40, file: !16, line: 145, baseType: !20, size: 64, offset: 64)
!44 = !DIDerivedType(tag: DW_TAG_member, name: "initmem_amd", scope: !40, file: !16, line: 146, baseType: !20, size: 64, offset: 128)
!45 = !DIDerivedType(tag: DW_TAG_member, name: "initmem", scope: !40, file: !16, line: 147, baseType: !20, size: 64, offset: 192)
!46 = !DIDerivedType(tag: DW_TAG_member, name: "maxwork", scope: !40, file: !16, line: 148, baseType: !20, size: 64, offset: 256)
!47 = !DIDerivedType(tag: DW_TAG_member, name: "btf", scope: !40, file: !16, line: 150, baseType: !5, size: 32, offset: 320)
!48 = !DIDerivedType(tag: DW_TAG_member, name: "ordering", scope: !40, file: !16, line: 151, baseType: !5, size: 32, offset: 352)
!49 = !DIDerivedType(tag: DW_TAG_member, name: "scale", scope: !40, file: !16, line: 153, baseType: !5, size: 32, offset: 384)
!50 = !DIDerivedType(tag: DW_TAG_member, name: "user_order", scope: !40, file: !16, line: 157, baseType: !51, size: 64, offset: 448)
!51 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !52, size: 64)
!52 = !DISubroutineType(types: !53)
!53 = !{!5, !5, !29, !29, !29, !54}
!54 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !40, size: 64)
!55 = !DIDerivedType(tag: DW_TAG_member, name: "user_data", scope: !40, file: !16, line: 162, baseType: !4, size: 64, offset: 512)
!56 = !DIDerivedType(tag: DW_TAG_member, name: "halt_if_singular", scope: !40, file: !16, line: 164, baseType: !5, size: 32, offset: 576)
!57 = !DIDerivedType(tag: DW_TAG_member, name: "status", scope: !40, file: !16, line: 177, baseType: !5, size: 32, offset: 608)
!58 = !DIDerivedType(tag: DW_TAG_member, name: "nrealloc", scope: !40, file: !16, line: 178, baseType: !5, size: 32, offset: 640)
!59 = !DIDerivedType(tag: DW_TAG_member, name: "structural_rank", scope: !40, file: !16, line: 180, baseType: !5, size: 32, offset: 672)
!60 = !DIDerivedType(tag: DW_TAG_member, name: "numerical_rank", scope: !40, file: !16, line: 185, baseType: !5, size: 32, offset: 704)
!61 = !DIDerivedType(tag: DW_TAG_member, name: "singular_col", scope: !40, file: !16, line: 191, baseType: !5, size: 32, offset: 736)
!62 = !DIDerivedType(tag: DW_TAG_member, name: "noffdiag", scope: !40, file: !16, line: 196, baseType: !5, size: 32, offset: 768)
!63 = !DIDerivedType(tag: DW_TAG_member, name: "flops", scope: !40, file: !16, line: 198, baseType: !20, size: 64, offset: 832)
!64 = !DIDerivedType(tag: DW_TAG_member, name: "rcond", scope: !40, file: !16, line: 199, baseType: !20, size: 64, offset: 896)
!65 = !DIDerivedType(tag: DW_TAG_member, name: "condest", scope: !40, file: !16, line: 200, baseType: !20, size: 64, offset: 960)
!66 = !DIDerivedType(tag: DW_TAG_member, name: "rgrowth", scope: !40, file: !16, line: 201, baseType: !20, size: 64, offset: 1024)
!67 = !DIDerivedType(tag: DW_TAG_member, name: "work", scope: !40, file: !16, line: 202, baseType: !20, size: 64, offset: 1088)
!68 = !DIDerivedType(tag: DW_TAG_member, name: "memusage", scope: !40, file: !16, line: 204, baseType: !69, size: 64, offset: 1152)
!69 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !70, line: 62, baseType: !71)
!70 = !DIFile(filename: "/Applications/Xcode.app/Contents/Developer/Toolchains/XcodeDefault.xctoolchain/usr/lib/clang/10.0.0/include/stddef.h", directory: "/Users/fak/Dropbox/Projects/SparsePerf/SparseSuite/SparseSuite")
!71 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!72 = !DIDerivedType(tag: DW_TAG_member, name: "mempeak", scope: !40, file: !16, line: 205, baseType: !69, size: 64, offset: 1216)
!73 = !{!74, !75, !76, !77}
!74 = !DILocalVariable(name: "n", arg: 1, scope: !11, file: !1, line: 449, type: !5)
!75 = !DILocalVariable(name: "Ap", arg: 2, scope: !11, file: !1, line: 450, type: !29)
!76 = !DILocalVariable(name: "Ai", arg: 3, scope: !11, file: !1, line: 451, type: !29)
!77 = !DILocalVariable(name: "Common", arg: 4, scope: !11, file: !1, line: 453, type: !38)
!78 = !DILocation(line: 449, column: 9, scope: !11)
!79 = !DILocation(line: 450, column: 9, scope: !11)
!80 = !DILocation(line: 451, column: 9, scope: !11)
!81 = !DILocation(line: 453, column: 17, scope: !11)
!82 = !DILocation(line: 461, column: 16, scope: !83)
!83 = distinct !DILexicalBlock(scope: !11, file: !1, line: 461, column: 9)
!84 = !DILocation(line: 461, column: 9, scope: !11)
!85 = !DILocation(line: 465, column: 13, scope: !11)
!86 = !DILocation(line: 465, column: 20, scope: !11)
!87 = !{!88, !92, i64 76}
!88 = !{!"klu_common_struct", !89, i64 0, !89, i64 8, !89, i64 16, !89, i64 24, !89, i64 32, !92, i64 40, !92, i64 44, !92, i64 48, !93, i64 56, !93, i64 64, !92, i64 72, !92, i64 76, !92, i64 80, !92, i64 84, !92, i64 88, !92, i64 92, !92, i64 96, !89, i64 104, !89, i64 112, !89, i64 120, !89, i64 128, !89, i64 136, !94, i64 144, !94, i64 152}
!89 = !{!"double", !90, i64 0}
!90 = !{!"omnipotent char", !91, i64 0}
!91 = !{!"Simple C/C++ TBAA"}
!92 = !{!"int", !90, i64 0}
!93 = !{!"any pointer", !90, i64 0}
!94 = !{!"long", !90, i64 0}
!95 = !DILocation(line: 466, column: 13, scope: !11)
!96 = !DILocation(line: 466, column: 29, scope: !11)
!97 = !{!88, !92, i64 84}
!98 = !DILocation(line: 472, column: 17, scope: !99)
!99 = distinct !DILexicalBlock(scope: !11, file: !1, line: 472, column: 9)
!100 = !{!88, !92, i64 44}
!101 = !DILocation(line: 472, column: 26, scope: !99)
!102 = !DILocation(line: 472, column: 9, scope: !11)
!103 = !DILocation(line: 475, column: 17, scope: !104)
!104 = distinct !DILexicalBlock(scope: !99, file: !1, line: 473, column: 5)
!105 = !DILocation(line: 475, column: 9, scope: !104)
!106 = !DILocation(line: 480, column: 17, scope: !107)
!107 = distinct !DILexicalBlock(scope: !99, file: !1, line: 478, column: 5)
!108 = !DILocation(line: 480, column: 9, scope: !107)
!109 = !DILocation(line: 0, scope: !107)
!110 = !DILocation(line: 482, column: 1, scope: !11)
!111 = distinct !DISubprogram(name: "order_and_analyze", scope: !1, file: !1, line: 257, type: !12, isLocal: true, isDefinition: true, scopeLine: 267, flags: DIFlagPrototyped, isOptimized: true, unit: !0, variables: !112)
!112 = !{!113, !114, !115, !116, !117, !118, !119, !120, !121, !122, !123, !124, !125, !126, !127, !128, !129, !130, !131, !132, !133, !134, !135, !136, !137, !138, !139, !140}
!113 = !DILocalVariable(name: "n", arg: 1, scope: !111, file: !1, line: 261, type: !5)
!114 = !DILocalVariable(name: "Ap", arg: 2, scope: !111, file: !1, line: 262, type: !29)
!115 = !DILocalVariable(name: "Ai", arg: 3, scope: !111, file: !1, line: 263, type: !29)
!116 = !DILocalVariable(name: "Common", arg: 4, scope: !111, file: !1, line: 265, type: !38)
!117 = !DILocalVariable(name: "work", scope: !111, file: !1, line: 268, type: !20)
!118 = !DILocalVariable(name: "Symbolic", scope: !111, file: !1, line: 269, type: !14)
!119 = !DILocalVariable(name: "Lnz", scope: !111, file: !1, line: 270, type: !25)
!120 = !DILocalVariable(name: "Qbtf", scope: !111, file: !1, line: 271, type: !29)
!121 = !DILocalVariable(name: "Cp", scope: !111, file: !1, line: 271, type: !29)
!122 = !DILocalVariable(name: "Ci", scope: !111, file: !1, line: 271, type: !29)
!123 = !DILocalVariable(name: "Pinv", scope: !111, file: !1, line: 271, type: !29)
!124 = !DILocalVariable(name: "Pblk", scope: !111, file: !1, line: 271, type: !29)
!125 = !DILocalVariable(name: "Pbtf", scope: !111, file: !1, line: 271, type: !29)
!126 = !DILocalVariable(name: "P", scope: !111, file: !1, line: 271, type: !29)
