; ModuleID = 'klu_memory.c'
source_filename = "klu_memory.c"
target datalayout = "e-m:o-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-apple-macosx10.14.0"

%struct.klu_common_struct = type { double, double, double, double, double, i32, i32, i32, i32 (i32, i32*, i32*, i32*, %struct.klu_common_struct*)*, i8*, i32, i32, i32, i32, i32, i32, i32, double, double, double, double, double, i64, i64 }

; Function Attrs: nounwind ssp uwtable
define i64 @klu_add_size_t(i64, i64, i32* nocapture) local_unnamed_addr #0 !dbg !13 {
  call void @llvm.dbg.value(metadata i64 %0, metadata !19, metadata !DIExpression()), !dbg !22
  call void @llvm.dbg.value(metadata i64 %1, metadata !20, metadata !DIExpression()), !dbg !23
  call void @llvm.dbg.value(metadata i32* %2, metadata !21, metadata !DIExpression()), !dbg !24
  %4 = load i32, i32* %2, align 4, !dbg !25, !tbaa !26
  %5 = icmp eq i32 %4, 0, !dbg !30
  br i1 %5, label %6, label %7, !dbg !31

; <label>:6:                                      ; preds = %3
  store i32 0, i32* %2, align 4, !dbg !32, !tbaa !26
  ret i64 -1, !dbg !33

; <label>:7:                                      ; preds = %3
  %8 = add i64 %1, %0, !dbg !34
  %9 = icmp ugt i64 %0, %1, !dbg !35
  %10 = select i1 %9, i64 %0, i64 %1, !dbg !35
  %11 = icmp uge i64 %8, %10, !dbg !36
  %12 = zext i1 %11 to i32, !dbg !31
  store i32 %12, i32* %2, align 4, !dbg !32, !tbaa !26
  %13 = select i1 %11, i64 %8, i64 -1, !dbg !37
  ret i64 %13, !dbg !37
}


!0 = distinct !DICompileUnit(language: DW_LANG_C99, file: !1, producer: "Apple LLVM version 10.0.0 (clang-1000.11.45.5)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !2, retainedTypes: !3)
!1 = !DIFile(filename: "klu_memory.c", directory: "/Users/fak/Dropbox/Projects/SparsePerf/SparseSuite/SparseSuite")
!2 = !{}
!3 = !{!4, !7}
!4 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !5, line: 62, baseType: !6)
!5 = !DIFile(filename: "/Applications/Xcode.app/Contents/Developer/Toolchains/XcodeDefault.xctoolchain/usr/lib/clang/10.0.0/include/stddef.h", directory: "/Users/fak/Dropbox/Projects/SparsePerf/SparseSuite/SparseSuite")
!6 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!7 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!8 = !{i32 2, !"Dwarf Version", i32 4}
!9 = !{i32 2, !"Debug Info Version", i32 3}
!10 = !{i32 1, !"wchar_size", i32 4}
!11 = !{i32 7, !"PIC Level", i32 2}
!12 = !{!"Apple LLVM version 10.0.0 (clang-1000.11.45.5)"}
!13 = distinct !DISubprogram(name: "klu_add_size_t", scope: !1, file: !1, line: 20, type: !14, isLocal: false, isDefinition: true, scopeLine: 21, flags: DIFlagPrototyped, isOptimized: true, unit: !0, variables: !18)
!14 = !DISubroutineType(types: !15)
!15 = !{!4, !4, !4, !16}
!16 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !17, size: 64)
!17 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!18 = !{!19, !20, !21}
!19 = !DILocalVariable(name: "a", arg: 1, scope: !13, file: !1, line: 20, type: !4)
!20 = !DILocalVariable(name: "b", arg: 2, scope: !13, file: !1, line: 20, type: !4)
!21 = !DILocalVariable(name: "ok", arg: 3, scope: !13, file: !1, line: 20, type: !16)
!22 = !DILocation(line: 20, column: 31, scope: !13)
!23 = !DILocation(line: 20, column: 41, scope: !13)
!24 = !DILocation(line: 20, column: 49, scope: !13)
!25 = !DILocation(line: 22, column: 14, scope: !13)
!26 = !{!27, !27, i64 0}
!27 = !{!"int", !28, i64 0}
!28 = !{!"omnipotent char", !29, i64 0}
!29 = !{!"Simple C/C++ TBAA"}
!30 = !DILocation(line: 22, column: 13, scope: !13)
!31 = !DILocation(line: 22, column: 19, scope: !13)
!32 = !DILocation(line: 22, column: 11, scope: !13)
!33 = !DILocation(line: 23, column: 5, scope: !13)
!34 = !DILocation(line: 22, column: 26, scope: !13)
!35 = !DILocation(line: 22, column: 34, scope: !13)
!36 = !DILocation(line: 22, column: 31, scope: !13)
!37 = !DILocation(line: 23, column: 13, scope: !13)
!38 = distinct !DISubprogram(name: "klu_mult_size_t", scope: !1, file: !1, line: 32, type: !14, isLocal: false, isDefinition: true, scopeLine: 33, flags: DIFlagPrototyped, isOptimized: true, unit: !0, variables: !39)
!39 = !{!40, !41, !42, !43, !44}
!40 = !DILocalVariable(name: "a", arg: 1, scope: !38, file: !1, line: 32, type: !4)
!41 = !DILocalVariable(name: "k", arg: 2, scope: !38, file: !1, line: 32, type: !4)
!42 = !DILocalVariable(name: "ok", arg: 3, scope: !38, file: !1, line: 32, type: !16)
!43 = !DILocalVariable(name: "i", scope: !38, file: !1, line: 34, type: !4)
!44 = !DILocalVariable(name: "s", scope: !38, file: !1, line: 34, type: !4)
!45 = !DILocation(line: 32, column: 32, scope: !38)
!46 = !DILocation(line: 32, column: 42, scope: !38)
!47 = !DILocation(line: 32, column: 50, scope: !38)
!48 = !DILocation(line: 34, column: 15, scope: !38)
!49 = !DILocation(line: 34, column: 12, scope: !38)
!50 = !DILocation(line: 35, column: 20, scope: !51)
!51 = distinct !DILexicalBlock(scope: !52, file: !1, line: 35, column: 5)
!52 = distinct !DILexicalBlock(scope: !38, file: !1, line: 35, column: 5)
!53 = !DILocation(line: 0, scope: !38)
!54 = !DILocation(line: 35, column: 5, scope: !52)
!55 = !DILocation(line: 22, column: 19, scope: !13, inlinedAt: !56)
!56 = distinct !DILocation(line: 37, column: 13, scope: !57)
!57 = distinct !DILexicalBlock(scope: !51, file: !1, line: 36, column: 5)
!58 = !DILocation(line: 20, column: 31, scope: !13, inlinedAt: !56)
!59 = !DILocation(line: 20, column: 41, scope: !13, inlinedAt: !56)
!60 = !DILocation(line: 20, column: 49, scope: !13, inlinedAt: !56)
!61 = !DILocation(line: 22, column: 11, scope: !13, inlinedAt: !56)
!62 = !DILocation(line: 23, column: 5, scope: !13, inlinedAt: !56)
!63 = !DILocation(line: 22, column: 26, scope: !13, inlinedAt: !56)
!64 = !DILocation(line: 22, column: 34, scope: !13, inlinedAt: !56)
!65 = !DILocation(line: 22, column: 31, scope: !13, inlinedAt: !56)
!66 = !DILocation(line: 23, column: 13, scope: !13, inlinedAt: !56)
!67 = !DILocation(line: 39, column: 13, scope: !38)
!68 = !DILocation(line: 39, column: 5, scope: !38)
!69 = distinct !{!69, !54, !70}
!70 = !DILocation(line: 38, column: 5, scope: !52)
!71 = distinct !DISubprogram(name: "klu_malloc", scope: !1, file: !1, line: 60, type: !72, isLocal: false, isDefinition: true, scopeLine: 68, flags: DIFlagPrototyped, isOptimized: true, unit: !0, variables: !108)
!72 = !DISubroutineType(types: !73)
!73 = !{!7, !4, !4, !74}
!74 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !75, size: 64)
!75 = !DIDerivedType(tag: DW_TAG_typedef, name: "klu_common", file: !76, line: 207, baseType: !77)
!76 = !DIFile(filename: "./klu.h", directory: "/Users/fak/Dropbox/Projects/SparsePerf/SparseSuite/SparseSuite")
!77 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "klu_common_struct", file: !76, line: 137, size: 1280, elements: !78)
!78 = !{!79, !81, !82, !83, !84, !85, !86, !87, !88, !93, !94, !95, !96, !97, !98, !99, !100, !101, !102, !103, !104, !105, !106, !107}
!79 = !DIDerivedType(tag: DW_TAG_member, name: "tol", scope: !77, file: !76, line: 144, baseType: !80, size: 64)
!80 = !DIBasicType(name: "double", size: 64, encoding: DW_ATE_float)
!81 = !DIDerivedType(tag: DW_TAG_member, name: "memgrow", scope: !77, file: !76, line: 145, baseType: !80, size: 64, offset: 64)
!82 = !DIDerivedType(tag: DW_TAG_member, name: "initmem_amd", scope: !77, file: !76, line: 146, baseType: !80, size: 64, offset: 128)
!83 = !DIDerivedType(tag: DW_TAG_member, name: "initmem", scope: !77, file: !76, line: 147, baseType: !80, size: 64, offset: 192)
!84 = !DIDerivedType(tag: DW_TAG_member, name: "maxwork", scope: !77, file: !76, line: 148, baseType: !80, size: 64, offset: 256)
!85 = !DIDerivedType(tag: DW_TAG_member, name: "btf", scope: !77, file: !76, line: 150, baseType: !17, size: 32, offset: 320)
!86 = !DIDerivedType(tag: DW_TAG_member, name: "ordering", scope: !77, file: !76, line: 151, baseType: !17, size: 32, offset: 352)
!87 = !DIDerivedType(tag: DW_TAG_member, name: "scale", scope: !77, file: !76, line: 153, baseType: !17, size: 32, offset: 384)
!88 = !DIDerivedType(tag: DW_TAG_member, name: "user_order", scope: !77, file: !76, line: 157, baseType: !89, size: 64, offset: 448)
!89 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !90, size: 64)
!90 = !DISubroutineType(types: !91)
!91 = !{!17, !17, !16, !16, !16, !92}
!92 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !77, size: 64)
!93 = !DIDerivedType(tag: DW_TAG_member, name: "user_data", scope: !77, file: !76, line: 162, baseType: !7, size: 64, offset: 512)
!94 = !DIDerivedType(tag: DW_TAG_member, name: "halt_if_singular", scope: !77, file: !76, line: 164, baseType: !17, size: 32, offset: 576)
!95 = !DIDerivedType(tag: DW_TAG_member, name: "status", scope: !77, file: !76, line: 177, baseType: !17, size: 32, offset: 608)
!96 = !DIDerivedType(tag: DW_TAG_member, name: "nrealloc", scope: !77, file: !76, line: 178, baseType: !17, size: 32, offset: 640)
!97 = !DIDerivedType(tag: DW_TAG_member, name: "structural_rank", scope: !77, file: !76, line: 180, baseType: !17, size: 32, offset: 672)
!98 = !DIDerivedType(tag: DW_TAG_member, name: "numerical_rank", scope: !77, file: !76, line: 185, baseType: !17, size: 32, offset: 704)
!99 = !DIDerivedType(tag: DW_TAG_member, name: "singular_col", scope: !77, file: !76, line: 191, baseType: !17, size: 32, offset: 736)
!100 = !DIDerivedType(tag: DW_TAG_member, name: "noffdiag", scope: !77, file: !76, line: 196, baseType: !17, size: 32, offset: 768)
!101 = !DIDerivedType(tag: DW_TAG_member, name: "flops", scope: !77, file: !76, line: 198, baseType: !80, size: 64, offset: 832)
!102 = !DIDerivedType(tag: DW_TAG_member, name: "rcond", scope: !77, file: !76, line: 199, baseType: !80, size: 64, offset: 896)
!103 = !DIDerivedType(tag: DW_TAG_member, name: "condest", scope: !77, file: !76, line: 200, baseType: !80, size: 64, offset: 960)
!104 = !DIDerivedType(tag: DW_TAG_member, name: "rgrowth", scope: !77, file: !76, line: 201, baseType: !80, size: 64, offset: 1024)
!105 = !DIDerivedType(tag: DW_TAG_member, name: "work", scope: !77, file: !76, line: 202, baseType: !80, size: 64, offset: 1088)
!106 = !DIDerivedType(tag: DW_TAG_member, name: "memusage", scope: !77, file: !76, line: 204, baseType: !4, size: 64, offset: 1152)
!107 = !DIDerivedType(tag: DW_TAG_member, name: "mempeak", scope: !77, file: !76, line: 205, baseType: !4, size: 64, offset: 1216)
!108 = !{!109, !110, !111, !112}
!109 = !DILocalVariable(name: "n", arg: 1, scope: !71, file: !1, line: 63, type: !4)
!110 = !DILocalVariable(name: "size", arg: 2, scope: !71, file: !1, line: 64, type: !4)
!111 = !DILocalVariable(name: "Common", arg: 3, scope: !71, file: !1, line: 66, type: !74)
!112 = !DILocalVariable(name: "p", scope: !71, file: !1, line: 69, type: !7)
!113 = !DILocation(line: 63, column: 12, scope: !71)
!114 = !DILocation(line: 64, column: 12, scope: !71)
!115 = !DILocation(line: 66, column: 17, scope: !71)
!116 = !DILocation(line: 71, column: 16, scope: !117)
!117 = distinct !DILexicalBlock(scope: !71, file: !1, line: 71, column: 9)
!118 = !DILocation(line: 71, column: 9, scope: !71)
!119 = !DILocation(line: 75, column: 19, scope: !120)
!120 = distinct !DILexicalBlock(scope: !117, file: !1, line: 75, column: 14)
!121 = !DILocation(line: 75, column: 14, scope: !117)
!122 = !DILocation(line: 78, column: 17, scope: !123)
!123 = distinct !DILexicalBlock(scope: !120, file: !1, line: 76, column: 5)
!124 = !DILocation(line: 78, column: 24, scope: !123)
!125 = !{!126, !27, i64 76}
!126 = !{!"klu_common_struct", !127, i64 0, !127, i64 8, !127, i64 16, !127, i64 24, !127, i64 32, !27, i64 40, !27, i64 44, !27, i64 48, !128, i64 56, !128, i64 64, !27, i64 72, !27, i64 76, !27, i64 80, !27, i64 84, !27, i64 88, !27, i64 92, !27, i64 96, !127, i64 104, !127, i64 112, !127, i64 120, !127, i64 128, !127, i64 136, !129, i64 144, !129, i64 152}
!127 = !{!"double", !28, i64 0}
!128 = !{!"any pointer", !28, i64 0}
!129 = !{!"long", !28, i64 0}
!130 = !DILocation(line: 69, column: 11, scope: !71)
!131 = !DILocation(line: 80, column: 5, scope: !123)
!132 = !DILocation(line: 81, column: 16, scope: !133)
!133 = distinct !DILexicalBlock(scope: !120, file: !1, line: 81, column: 14)
!134 = !DILocation(line: 81, column: 14, scope: !120)
!135 = !DILocation(line: 85, column: 17, scope: !136)
!136 = distinct !DILexicalBlock(scope: !133, file: !1, line: 82, column: 5)
!137 = !DILocation(line: 85, column: 24, scope: !136)
!138 = !DILocation(line: 87, column: 5, scope: !136)
!139 = !DILocation(line: 91, column: 13, scope: !140)
!140 = distinct !DILexicalBlock(scope: !133, file: !1, line: 89, column: 5)
!141 = !DILocation(line: 92, column: 15, scope: !142)
!142 = distinct !DILexicalBlock(scope: !140, file: !1, line: 92, column: 13)
!143 = !DILocation(line: 92, column: 13, scope: !140)
!144 = !DILocation(line: 95, column: 21, scope: !145)
!145 = distinct !DILexicalBlock(scope: !142, file: !1, line: 93, column: 9)
!146 = !DILocation(line: 95, column: 28, scope: !145)
!147 = !DILocation(line: 96, column: 9, scope: !145)
!148 = !DILocation(line: 99, column: 34, scope: !149)
!149 = distinct !DILexicalBlock(scope: !142, file: !1, line: 98, column: 9)
!150 = !DILocation(line: 99, column: 44, scope: !149)
!151 = !DILocation(line: 99, column: 21, scope: !149)
!152 = !DILocation(line: 99, column: 30, scope: !149)
!153 = !{!126, !129, i64 144}
!154 = !DILocation(line: 100, column: 31, scope: !149)
!155 = !{!126, !129, i64 152}
!156 = !DILocation(line: 100, column: 29, scope: !149)
!157 = !DILocation(line: 0, scope: !140)
!158 = !DILocation(line: 103, column: 5, scope: !71)
!159 = distinct !DISubprogram(name: "klu_free", scope: !1, file: !1, line: 117, type: !160, isLocal: false, isDefinition: true, scopeLine: 127, flags: DIFlagPrototyped, isOptimized: true, unit: !0, variables: !162)
!160 = !DISubroutineType(types: !161)
!161 = !{!7, !7, !4, !4, !74}
!162 = !{!163, !164, !165, !166}
!163 = !DILocalVariable(name: "p", arg: 1, scope: !159, file: !1, line: 120, type: !7)
!164 = !DILocalVariable(name: "n", arg: 2, scope: !159, file: !1, line: 122, type: !4)
!165 = !DILocalVariable(name: "size", arg: 3, scope: !159, file: !1, line: 123, type: !4)
!166 = !DILocalVariable(name: "Common", arg: 4, scope: !159, file: !1, line: 125, type: !74)
