; ModuleID = 'klu_kernel.c'
source_filename = "klu_kernel.c"
target datalayout = "e-m:o-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-apple-macosx10.14.0"

%struct.SuiteSparse_config_struct = type { i8* (i64)*, i8* (i64, i64)*, i8* (i8*, i64)*, void (i8*)*, i32 (i8*, ...)*, double (double, double)*, i32 (double, double, double, double, double*, double*)* }
%struct.klu_common_struct = type { double, double, double, double, double, i32, i32, i32, i32 (i32, i32*, i32*, i32*, %struct.klu_common_struct*)*, i8*, i32, i32, i32, i32, i32, i32, i32, double, double, double, double, double, i64, i64 }

@SuiteSparse_config = external local_unnamed_addr global %struct.SuiteSparse_config_struct, align 8
@.str = private unnamed_addr constant [19 x i8] c"input: lusize %d \0A\00", align 1
@__FUNCTION__.klu_kernel = private unnamed_addr constant [11 x i8] c"klu_kernel\00", align 1
@.str.1 = private unnamed_addr constant [13 x i8] c"klu_kernel.c\00", align 1
@.str.2 = private unnamed_addr constant [46 x i8] c"\0A\0A==================================== k: %d\0A\00", align 1
@.str.3 = private unnamed_addr constant [33 x i8] c"lup %d lusize %g lup+nunits: %g\0A\00", align 1
@.str.4 = private unnamed_addr constant [36 x i8] c"Matrix is too large (Int overflow)\0A\00", align 1
@.str.5 = private unnamed_addr constant [26 x i8] c"Matrix is too large (LU)\0A\00", align 1
@.str.6 = private unnamed_addr constant [19 x i8] c"inc LU to %d done\0A\00", align 1

!0 = distinct !DICompileUnit(language: DW_LANG_C99, file: !1, producer: "Apple LLVM version 10.0.0 (clang-1000.11.45.5)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !2, retainedTypes: !3)
!1 = !DIFile(filename: "klu_kernel.c", directory: "/Users/fak/Dropbox/Projects/SparsePerf/SparseSuite/SparseSuite")
!2 = !{}
!3 = !{!4, !5, !6, !8}
!4 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!5 = !DIBasicType(name: "double", size: 64, encoding: DW_ATE_float)
!6 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !7, size: 64)
!7 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!8 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !5, size: 64)
!9 = !{i32 2, !"Dwarf Version", i32 4}
!10 = !{i32 2, !"Debug Info Version", i32 3}
!11 = !{i32 1, !"wchar_size", i32 4}
!12 = !{i32 7, !"PIC Level", i32 2}
!13 = !{!"Apple LLVM version 10.0.0 (clang-1000.11.45.5)"}
!14 = distinct !DISubprogram(name: "klu_kernel", scope: !1, file: !1, line: 640, type: !15, isLocal: false, isDefinition: true, scopeLine: 686, flags: DIFlagPrototyped, isOptimized: true, unit: !0, variables: !57)
!15 = !DISubroutineType(types: !16)
!16 = !{!17, !7, !6, !6, !8, !6, !17, !6, !6, !20, !8, !6, !6, !6, !6, !6, !6, !8, !6, !6, !6, !6, !7, !6, !8, !6, !6, !8, !24}
!17 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !18, line: 62, baseType: !19)
!18 = !DIFile(filename: "/Applications/Xcode.app/Contents/Developer/Toolchains/XcodeDefault.xctoolchain/usr/lib/clang/10.0.0/include/stddef.h", directory: "/Users/fak/Dropbox/Projects/SparsePerf/SparseSuite/SparseSuite")
!19 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!20 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !21, size: 64)
!21 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !22, size: 64)
!22 = !DIDerivedType(tag: DW_TAG_typedef, name: "Unit", file: !23, line: 253, baseType: !5)
!23 = !DIFile(filename: "./klu_version.h", directory: "/Users/fak/Dropbox/Projects/SparsePerf/SparseSuite/SparseSuite")
!24 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !25, size: 64)
!25 = !DIDerivedType(tag: DW_TAG_typedef, name: "klu_common", file: !26, line: 207, baseType: !27)
!26 = !DIFile(filename: "./klu.h", directory: "/Users/fak/Dropbox/Projects/SparsePerf/SparseSuite/SparseSuite")
!27 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "klu_common_struct", file: !26, line: 137, size: 1280, elements: !28)
!28 = !{!29, !30, !31, !32, !33, !34, !35, !36, !37, !42, !43, !44, !45, !46, !47, !48, !49, !50, !51, !52, !53, !54, !55, !56}
!29 = !DIDerivedType(tag: DW_TAG_member, name: "tol", scope: !27, file: !26, line: 144, baseType: !5, size: 64)
!30 = !DIDerivedType(tag: DW_TAG_member, name: "memgrow", scope: !27, file: !26, line: 145, baseType: !5, size: 64, offset: 64)
!31 = !DIDerivedType(tag: DW_TAG_member, name: "initmem_amd", scope: !27, file: !26, line: 146, baseType: !5, size: 64, offset: 128)
!32 = !DIDerivedType(tag: DW_TAG_member, name: "initmem", scope: !27, file: !26, line: 147, baseType: !5, size: 64, offset: 192)
!33 = !DIDerivedType(tag: DW_TAG_member, name: "maxwork", scope: !27, file: !26, line: 148, baseType: !5, size: 64, offset: 256)
!34 = !DIDerivedType(tag: DW_TAG_member, name: "btf", scope: !27, file: !26, line: 150, baseType: !7, size: 32, offset: 320)
!35 = !DIDerivedType(tag: DW_TAG_member, name: "ordering", scope: !27, file: !26, line: 151, baseType: !7, size: 32, offset: 352)
!36 = !DIDerivedType(tag: DW_TAG_member, name: "scale", scope: !27, file: !26, line: 153, baseType: !7, size: 32, offset: 384)
!37 = !DIDerivedType(tag: DW_TAG_member, name: "user_order", scope: !27, file: !26, line: 157, baseType: !38, size: 64, offset: 448)
!38 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !39, size: 64)
!39 = !DISubroutineType(types: !40)
!40 = !{!7, !7, !6, !6, !6, !41}
!41 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !27, size: 64)
!42 = !DIDerivedType(tag: DW_TAG_member, name: "user_data", scope: !27, file: !26, line: 162, baseType: !4, size: 64, offset: 512)
!43 = !DIDerivedType(tag: DW_TAG_member, name: "halt_if_singular", scope: !27, file: !26, line: 164, baseType: !7, size: 32, offset: 576)
!44 = !DIDerivedType(tag: DW_TAG_member, name: "status", scope: !27, file: !26, line: 177, baseType: !7, size: 32, offset: 608)
!45 = !DIDerivedType(tag: DW_TAG_member, name: "nrealloc", scope: !27, file: !26, line: 178, baseType: !7, size: 32, offset: 640)
!46 = !DIDerivedType(tag: DW_TAG_member, name: "structural_rank", scope: !27, file: !26, line: 180, baseType: !7, size: 32, offset: 672)
!47 = !DIDerivedType(tag: DW_TAG_member, name: "numerical_rank", scope: !27, file: !26, line: 185, baseType: !7, size: 32, offset: 704)
!48 = !DIDerivedType(tag: DW_TAG_member, name: "singular_col", scope: !27, file: !26, line: 191, baseType: !7, size: 32, offset: 736)
!49 = !DIDerivedType(tag: DW_TAG_member, name: "noffdiag", scope: !27, file: !26, line: 196, baseType: !7, size: 32, offset: 768)
!50 = !DIDerivedType(tag: DW_TAG_member, name: "flops", scope: !27, file: !26, line: 198, baseType: !5, size: 64, offset: 832)
!51 = !DIDerivedType(tag: DW_TAG_member, name: "rcond", scope: !27, file: !26, line: 199, baseType: !5, size: 64, offset: 896)
!52 = !DIDerivedType(tag: DW_TAG_member, name: "condest", scope: !27, file: !26, line: 200, baseType: !5, size: 64, offset: 960)
!53 = !DIDerivedType(tag: DW_TAG_member, name: "rgrowth", scope: !27, file: !26, line: 201, baseType: !5, size: 64, offset: 1024)
!54 = !DIDerivedType(tag: DW_TAG_member, name: "work", scope: !27, file: !26, line: 202, baseType: !5, size: 64, offset: 1088)
!55 = !DIDerivedType(tag: DW_TAG_member, name: "memusage", scope: !27, file: !26, line: 204, baseType: !17, size: 64, offset: 1152)
!56 = !DIDerivedType(tag: DW_TAG_member, name: "mempeak", scope: !27, file: !26, line: 205, baseType: !17, size: 64, offset: 1216)
!57 = !{!58, !59, !60, !61, !62, !63, !64, !65, !66, !67, !68, !69, !70, !71, !72, !73, !74, !75, !76, !77, !78, !79, !80, !81, !82, !83, !84, !85, !86, !87, !88, !89, !90, !91, !92, !93, !94, !95, !96, !97, !98, !99, !100, !101, !102, !103, !104, !105, !106, !107, !108, !109}
!58 = !DILocalVariable(name: "n", arg: 1, scope: !14, file: !1, line: 643, type: !7)
!59 = !DILocalVariable(name: "Ap", arg: 2, scope: !14, file: !1, line: 644, type: !6)
!60 = !DILocalVariable(name: "Ai", arg: 3, scope: !14, file: !1, line: 645, type: !6)
!61 = !DILocalVariable(name: "Ax", arg: 4, scope: !14, file: !1, line: 646, type: !8)
!62 = !DILocalVariable(name: "Q", arg: 5, scope: !14, file: !1, line: 647, type: !6)
!63 = !DILocalVariable(name: "lusize", arg: 6, scope: !14, file: !1, line: 648, type: !17)
!64 = !DILocalVariable(name: "Pinv", arg: 7, scope: !14, file: !1, line: 651, type: !6)
!65 = !DILocalVariable(name: "P", arg: 8, scope: !14, file: !1, line: 653, type: !6)
!66 = !DILocalVariable(name: "p_LU", arg: 9, scope: !14, file: !1, line: 655, type: !20)
!67 = !DILocalVariable(name: "Udiag", arg: 10, scope: !14, file: !1, line: 656, type: !8)
!68 = !DILocalVariable(name: "Llen", arg: 11, scope: !14, file: !1, line: 657, type: !6)
!69 = !DILocalVariable(name: "Ulen", arg: 12, scope: !14, file: !1, line: 658, type: !6)
!70 = !DILocalVariable(name: "Lip", arg: 13, scope: !14, file: !1, line: 659, type: !6)
!71 = !DILocalVariable(name: "Uip", arg: 14, scope: !14, file: !1, line: 660, type: !6)
!72 = !DILocalVariable(name: "lnz", arg: 15, scope: !14, file: !1, line: 661, type: !6)
!73 = !DILocalVariable(name: "unz", arg: 16, scope: !14, file: !1, line: 662, type: !6)
!74 = !DILocalVariable(name: "X", arg: 17, scope: !14, file: !1, line: 664, type: !8)
!75 = !DILocalVariable(name: "Stack", arg: 18, scope: !14, file: !1, line: 667, type: !6)
!76 = !DILocalVariable(name: "Flag", arg: 19, scope: !14, file: !1, line: 668, type: !6)
!77 = !DILocalVariable(name: "Ap_pos", arg: 20, scope: !14, file: !1, line: 669, type: !6)
!78 = !DILocalVariable(name: "Lpend", arg: 21, scope: !14, file: !1, line: 672, type: !6)
!79 = !DILocalVariable(name: "k1", arg: 22, scope: !14, file: !1, line: 675, type: !7)
!80 = !DILocalVariable(name: "PSinv", arg: 23, scope: !14, file: !1, line: 676, type: !6)
!81 = !DILocalVariable(name: "Rs", arg: 24, scope: !14, file: !1, line: 677, type: !8)
!82 = !DILocalVariable(name: "Offp", arg: 25, scope: !14, file: !1, line: 680, type: !6)
!83 = !DILocalVariable(name: "Offi", arg: 26, scope: !14, file: !1, line: 681, type: !6)
!84 = !DILocalVariable(name: "Offx", arg: 27, scope: !14, file: !1, line: 682, type: !8)
!85 = !DILocalVariable(name: "Common", arg: 28, scope: !14, file: !1, line: 684, type: !24)
!86 = !DILocalVariable(name: "pivot", scope: !14, file: !1, line: 687, type: !5)
!87 = !DILocalVariable(name: "abs_pivot", scope: !14, file: !1, line: 688, type: !5)
!88 = !DILocalVariable(name: "xsize", scope: !14, file: !1, line: 688, type: !5)
!89 = !DILocalVariable(name: "nunits", scope: !14, file: !1, line: 688, type: !5)
!90 = !DILocalVariable(name: "tol", scope: !14, file: !1, line: 688, type: !5)
!91 = !DILocalVariable(name: "memgrow", scope: !14, file: !1, line: 688, type: !5)
!92 = !DILocalVariable(name: "Ux", scope: !14, file: !1, line: 689, type: !8)
!93 = !DILocalVariable(name: "Li", scope: !14, file: !1, line: 690, type: !6)
!94 = !DILocalVariable(name: "Ui", scope: !14, file: !1, line: 690, type: !6)
!95 = !DILocalVariable(name: "LU", scope: !14, file: !1, line: 691, type: !21)
!96 = !DILocalVariable(name: "k", scope: !14, file: !1, line: 692, type: !7)
!97 = !DILocalVariable(name: "p", scope: !14, file: !1, line: 692, type: !7)
!98 = !DILocalVariable(name: "i", scope: !14, file: !1, line: 692, type: !7)
!99 = !DILocalVariable(name: "j", scope: !14, file: !1, line: 692, type: !7)
