; ModuleID = 'klu_extract.c'
source_filename = "klu_extract.c"
target datalayout = "e-m:o-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-apple-macosx10.14.0"

%struct.klu_numeric = type { i32, i32, i32, i32, i32, i32, i32*, i32*, i32*, i32*, i32*, i32*, i8**, i64*, i8*, double*, i64, i8*, i8*, i32*, i32*, i32*, i8*, i32 }
%struct.klu_symbolic = type { double, double, double, double, double*, i32, i32, i32*, i32*, i32*, i32, i32, i32, i32, i32, i32 }
%struct.klu_common_struct = type { double, double, double, double, double, i32, i32, i32, i32 (i32, i32*, i32*, i32*, %struct.klu_common_struct*)*, i8*, i32, i32, i32, i32, i32, i32, i32, double, double, double, double, double, i64, i64 }

@.memset_pattern = private unnamed_addr constant [2 x double] [double 1.000000e+00, double 1.000000e+00], align 16

; Function Attrs: nounwind ssp uwtable
define i32 @klu_extract(%struct.klu_numeric* readonly, %struct.klu_symbolic* readonly, i32*, i32*, double*, i32*, i32*, double*, i32*, i32*, double*, i32*, i32*, double*, i32*, %struct.klu_common_struct*) local_unnamed_addr #0 !dbg !14 {
  call void @llvm.dbg.value(metadata %struct.klu_numeric* %0, metadata !104, metadata !DIExpression()), !dbg !169
  call void @llvm.dbg.value(metadata %struct.klu_symbolic* %1, metadata !105, metadata !DIExpression()), !dbg !170
  call void @llvm.dbg.value(metadata i32* %2, metadata !106, metadata !DIExpression()), !dbg !171

!0 = distinct !DICompileUnit(language: DW_LANG_C99, file: !1, producer: "Apple LLVM version 10.0.0 (clang-1000.11.45.5)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !2, retainedTypes: !3)
!1 = !DIFile(filename: "klu_extract.c", directory: "/Users/fak/Dropbox/Projects/SparsePerf/SparseSuite/SparseSuite")
!2 = !{}
!3 = !{!4, !5, !7}
!4 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!5 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !6, size: 64)
!6 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!7 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !8, size: 64)
!8 = !DIBasicType(name: "double", size: 64, encoding: DW_ATE_float)
!9 = !{i32 2, !"Dwarf Version", i32 4}
!10 = !{i32 2, !"Debug Info Version", i32 3}
!11 = !{i32 1, !"wchar_size", i32 4}
!12 = !{i32 7, !"PIC Level", i32 2}
!13 = !{!"Apple LLVM version 10.0.0 (clang-1000.11.45.5)"}
!14 = distinct !DISubprogram(name: "klu_extract", scope: !1, file: !1, line: 14, type: !15, isLocal: false, isDefinition: true, scopeLine: 60, flags: DIFlagPrototyped, isOptimized: true, unit: !0, variables: !103)
!15 = !DISubroutineType(types: !16)
!16 = !{!6, !17, !51, !5, !5, !7, !5, !5, !7, !5, !5, !7, !5, !5, !7, !5, !71}
!17 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !18, size: 64)
!18 = !DIDerivedType(tag: DW_TAG_typedef, name: "klu_numeric", file: !19, line: 107, baseType: !20)
!19 = !DIFile(filename: "./klu.h", directory: "/Users/fak/Dropbox/Projects/SparsePerf/SparseSuite/SparseSuite")
!20 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !19, line: 69, size: 1344, elements: !21)
!21 = !{!22, !23, !24, !25, !26, !27, !28, !29, !30, !31, !32, !33, !34, !36, !41, !42, !43, !44, !45, !46, !47, !48, !49, !50}
!22 = !DIDerivedType(tag: DW_TAG_member, name: "n", scope: !20, file: !19, line: 74, baseType: !6, size: 32)
!23 = !DIDerivedType(tag: DW_TAG_member, name: "nblocks", scope: !20, file: !19, line: 75, baseType: !6, size: 32, offset: 32)
!24 = !DIDerivedType(tag: DW_TAG_member, name: "lnz", scope: !20, file: !19, line: 76, baseType: !6, size: 32, offset: 64)
!25 = !DIDerivedType(tag: DW_TAG_member, name: "unz", scope: !20, file: !19, line: 77, baseType: !6, size: 32, offset: 96)
!26 = !DIDerivedType(tag: DW_TAG_member, name: "max_lnz_block", scope: !20, file: !19, line: 78, baseType: !6, size: 32, offset: 128)
!27 = !DIDerivedType(tag: DW_TAG_member, name: "max_unz_block", scope: !20, file: !19, line: 79, baseType: !6, size: 32, offset: 160)
!28 = !DIDerivedType(tag: DW_TAG_member, name: "Pnum", scope: !20, file: !19, line: 80, baseType: !5, size: 64, offset: 192)
!29 = !DIDerivedType(tag: DW_TAG_member, name: "Pinv", scope: !20, file: !19, line: 81, baseType: !5, size: 64, offset: 256)
!30 = !DIDerivedType(tag: DW_TAG_member, name: "Lip", scope: !20, file: !19, line: 84, baseType: !5, size: 64, offset: 320)
!31 = !DIDerivedType(tag: DW_TAG_member, name: "Uip", scope: !20, file: !19, line: 85, baseType: !5, size: 64, offset: 384)
!32 = !DIDerivedType(tag: DW_TAG_member, name: "Llen", scope: !20, file: !19, line: 86, baseType: !5, size: 64, offset: 448)
!33 = !DIDerivedType(tag: DW_TAG_member, name: "Ulen", scope: !20, file: !19, line: 87, baseType: !5, size: 64, offset: 512)
!34 = !DIDerivedType(tag: DW_TAG_member, name: "LUbx", scope: !20, file: !19, line: 88, baseType: !35, size: 64, offset: 576)
!35 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !4, size: 64)
!36 = !DIDerivedType(tag: DW_TAG_member, name: "LUsize", scope: !20, file: !19, line: 89, baseType: !37, size: 64, offset: 640)
!37 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !38, size: 64)
!38 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !39, line: 62, baseType: !40)
!39 = !DIFile(filename: "/Applications/Xcode.app/Contents/Developer/Toolchains/XcodeDefault.xctoolchain/usr/lib/clang/10.0.0/include/stddef.h", directory: "/Users/fak/Dropbox/Projects/SparsePerf/SparseSuite/SparseSuite")
!40 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!41 = !DIDerivedType(tag: DW_TAG_member, name: "Udiag", scope: !20, file: !19, line: 90, baseType: !4, size: 64, offset: 704)
!42 = !DIDerivedType(tag: DW_TAG_member, name: "Rs", scope: !20, file: !19, line: 93, baseType: !7, size: 64, offset: 768)
!43 = !DIDerivedType(tag: DW_TAG_member, name: "worksize", scope: !20, file: !19, line: 96, baseType: !38, size: 64, offset: 832)
!44 = !DIDerivedType(tag: DW_TAG_member, name: "Work", scope: !20, file: !19, line: 97, baseType: !4, size: 64, offset: 896)
!45 = !DIDerivedType(tag: DW_TAG_member, name: "Xwork", scope: !20, file: !19, line: 98, baseType: !4, size: 64, offset: 960)
!46 = !DIDerivedType(tag: DW_TAG_member, name: "Iwork", scope: !20, file: !19, line: 99, baseType: !5, size: 64, offset: 1024)
!47 = !DIDerivedType(tag: DW_TAG_member, name: "Offp", scope: !20, file: !19, line: 102, baseType: !5, size: 64, offset: 1088)
!48 = !DIDerivedType(tag: DW_TAG_member, name: "Offi", scope: !20, file: !19, line: 103, baseType: !5, size: 64, offset: 1152)
!49 = !DIDerivedType(tag: DW_TAG_member, name: "Offx", scope: !20, file: !19, line: 104, baseType: !4, size: 64, offset: 1216)
!50 = !DIDerivedType(tag: DW_TAG_member, name: "nzoff", scope: !20, file: !19, line: 105, baseType: !6, size: 32, offset: 1280)
!51 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !52, size: 64)
!52 = !DIDerivedType(tag: DW_TAG_typedef, name: "klu_symbolic", file: !19, line: 54, baseType: !53)
!53 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !19, line: 23, size: 768, elements: !54)
!54 = !{!55, !56, !57, !58, !59, !60, !61, !62, !63, !64, !65, !66, !67, !68, !69, !70}
!55 = !DIDerivedType(tag: DW_TAG_member, name: "symmetry", scope: !53, file: !19, line: 31, baseType: !8, size: 64)
!56 = !DIDerivedType(tag: DW_TAG_member, name: "est_flops", scope: !53, file: !19, line: 32, baseType: !8, size: 64, offset: 64)
!57 = !DIDerivedType(tag: DW_TAG_member, name: "lnz", scope: !53, file: !19, line: 33, baseType: !8, size: 64, offset: 128)
!58 = !DIDerivedType(tag: DW_TAG_member, name: "unz", scope: !53, file: !19, line: 33, baseType: !8, size: 64, offset: 192)
!59 = !DIDerivedType(tag: DW_TAG_member, name: "Lnz", scope: !53, file: !19, line: 34, baseType: !7, size: 64, offset: 256)
!60 = !DIDerivedType(tag: DW_TAG_member, name: "n", scope: !53, file: !19, line: 38, baseType: !6, size: 32, offset: 320)
!61 = !DIDerivedType(tag: DW_TAG_member, name: "nz", scope: !53, file: !19, line: 39, baseType: !6, size: 32, offset: 352)
!62 = !DIDerivedType(tag: DW_TAG_member, name: "P", scope: !53, file: !19, line: 40, baseType: !5, size: 64, offset: 384)
!63 = !DIDerivedType(tag: DW_TAG_member, name: "Q", scope: !53, file: !19, line: 41, baseType: !5, size: 64, offset: 448)
!64 = !DIDerivedType(tag: DW_TAG_member, name: "R", scope: !53, file: !19, line: 42, baseType: !5, size: 64, offset: 512)
!65 = !DIDerivedType(tag: DW_TAG_member, name: "nzoff", scope: !53, file: !19, line: 43, baseType: !6, size: 32, offset: 576)
!66 = !DIDerivedType(tag: DW_TAG_member, name: "nblocks", scope: !53, file: !19, line: 44, baseType: !6, size: 32, offset: 608)
!67 = !DIDerivedType(tag: DW_TAG_member, name: "maxblock", scope: !53, file: !19, line: 45, baseType: !6, size: 32, offset: 640)
!68 = !DIDerivedType(tag: DW_TAG_member, name: "ordering", scope: !53, file: !19, line: 46, baseType: !6, size: 32, offset: 672)
!69 = !DIDerivedType(tag: DW_TAG_member, name: "do_btf", scope: !53, file: !19, line: 47, baseType: !6, size: 32, offset: 704)
!70 = !DIDerivedType(tag: DW_TAG_member, name: "structural_rank", scope: !53, file: !19, line: 50, baseType: !6, size: 32, offset: 736)
!71 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !72, size: 64)
!72 = !DIDerivedType(tag: DW_TAG_typedef, name: "klu_common", file: !19, line: 207, baseType: !73)
!73 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "klu_common_struct", file: !19, line: 137, size: 1280, elements: !74)
!74 = !{!75, !76, !77, !78, !79, !80, !81, !82, !83, !88, !89, !90, !91, !92, !93, !94, !95, !96, !97, !98, !99, !100, !101, !102}
!75 = !DIDerivedType(tag: DW_TAG_member, name: "tol", scope: !73, file: !19, line: 144, baseType: !8, size: 64)
!76 = !DIDerivedType(tag: DW_TAG_member, name: "memgrow", scope: !73, file: !19, line: 145, baseType: !8, size: 64, offset: 64)
!77 = !DIDerivedType(tag: DW_TAG_member, name: "initmem_amd", scope: !73, file: !19, line: 146, baseType: !8, size: 64, offset: 128)
!78 = !DIDerivedType(tag: DW_TAG_member, name: "initmem", scope: !73, file: !19, line: 147, baseType: !8, size: 64, offset: 192)
!79 = !DIDerivedType(tag: DW_TAG_member, name: "maxwork", scope: !73, file: !19, line: 148, baseType: !8, size: 64, offset: 256)
!80 = !DIDerivedType(tag: DW_TAG_member, name: "btf", scope: !73, file: !19, line: 150, baseType: !6, size: 32, offset: 320)
!81 = !DIDerivedType(tag: DW_TAG_member, name: "ordering", scope: !73, file: !19, line: 151, baseType: !6, size: 32, offset: 352)
!82 = !DIDerivedType(tag: DW_TAG_member, name: "scale", scope: !73, file: !19, line: 153, baseType: !6, size: 32, offset: 384)
!83 = !DIDerivedType(tag: DW_TAG_member, name: "user_order", scope: !73, file: !19, line: 157, baseType: !84, size: 64, offset: 448)
!84 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !85, size: 64)
!85 = !DISubroutineType(types: !86)
!86 = !{!6, !6, !5, !5, !5, !87}
!87 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !73, size: 64)
!88 = !DIDerivedType(tag: DW_TAG_member, name: "user_data", scope: !73, file: !19, line: 162, baseType: !4, size: 64, offset: 512)
!89 = !DIDerivedType(tag: DW_TAG_member, name: "halt_if_singular", scope: !73, file: !19, line: 164, baseType: !6, size: 32, offset: 576)
!90 = !DIDerivedType(tag: DW_TAG_member, name: "status", scope: !73, file: !19, line: 177, baseType: !6, size: 32, offset: 608)
!91 = !DIDerivedType(tag: DW_TAG_member, name: "nrealloc", scope: !73, file: !19, line: 178, baseType: !6, size: 32, offset: 640)
!92 = !DIDerivedType(tag: DW_TAG_member, name: "structural_rank", scope: !73, file: !19, line: 180, baseType: !6, size: 32, offset: 672)
!93 = !DIDerivedType(tag: DW_TAG_member, name: "numerical_rank", scope: !73, file: !19, line: 185, baseType: !6, size: 32, offset: 704)
!94 = !DIDerivedType(tag: DW_TAG_member, name: "singular_col", scope: !73, file: !19, line: 191, baseType: !6, size: 32, offset: 736)
!95 = !DIDerivedType(tag: DW_TAG_member, name: "noffdiag", scope: !73, file: !19, line: 196, baseType: !6, size: 32, offset: 768)
!96 = !DIDerivedType(tag: DW_TAG_member, name: "flops", scope: !73, file: !19, line: 198, baseType: !8, size: 64, offset: 832)
!97 = !DIDerivedType(tag: DW_TAG_member, name: "rcond", scope: !73, file: !19, line: 199, baseType: !8, size: 64, offset: 896)
!98 = !DIDerivedType(tag: DW_TAG_member, name: "condest", scope: !73, file: !19, line: 200, baseType: !8, size: 64, offset: 960)
!99 = !DIDerivedType(tag: DW_TAG_member, name: "rgrowth", scope: !73, file: !19, line: 201, baseType: !8, size: 64, offset: 1024)
!100 = !DIDerivedType(tag: DW_TAG_member, name: "work", scope: !73, file: !19, line: 202, baseType: !8, size: 64, offset: 1088)
!101 = !DIDerivedType(tag: DW_TAG_member, name: "memusage", scope: !73, file: !19, line: 204, baseType: !38, size: 64, offset: 1152)
!102 = !DIDerivedType(tag: DW_TAG_member, name: "mempeak", scope: !73, file: !19, line: 205, baseType: !38, size: 64, offset: 1216)
!103 = !{!104, !105, !106, !107, !108, !109, !110, !111, !112, !113, !114, !115, !116, !117, !118, !119, !120, !121, !122, !123, !124, !125, !126, !130, !131, !132, !133, !134, !135, !136, !137, !138, !139, !140, !141, !142, !143, !144, !145, !157}
!104 = !DILocalVariable(name: "Numeric", arg: 1, scope: !14, file: !1, line: 17, type: !17)
!105 = !DILocalVariable(name: "Symbolic", arg: 2, scope: !14, file: !1, line: 18, type: !51)
!106 = !DILocalVariable(name: "Lp", arg: 3, scope: !14, file: !1, line: 23, type: !5)
!107 = !DILocalVariable(name: "Li", arg: 4, scope: !14, file: !1, line: 24, type: !5)
!108 = !DILocalVariable(name: "Lx", arg: 5, scope: !14, file: !1, line: 25, type: !7)
!109 = !DILocalVariable(name: "Up", arg: 6, scope: !14, file: !1, line: 31, type: !5)
!110 = !DILocalVariable(name: "Ui", arg: 7, scope: !14, file: !1, line: 32, type: !5)
!111 = !DILocalVariable(name: "Ux", arg: 8, scope: !14, file: !1, line: 33, type: !7)
!112 = !DILocalVariable(name: "Fp", arg: 9, scope: !14, file: !1, line: 39, type: !5)
!113 = !DILocalVariable(name: "Fi", arg: 10, scope: !14, file: !1, line: 40, type: !5)
!114 = !DILocalVariable(name: "Fx", arg: 11, scope: !14, file: !1, line: 41, type: !7)
!115 = !DILocalVariable(name: "P", arg: 12, scope: !14, file: !1, line: 47, type: !5)
!116 = !DILocalVariable(name: "Q", arg: 13, scope: !14, file: !1, line: 50, type: !5)
!117 = !DILocalVariable(name: "Rs", arg: 14, scope: !14, file: !1, line: 53, type: !7)
!118 = !DILocalVariable(name: "R", arg: 15, scope: !14, file: !1, line: 56, type: !5)
!119 = !DILocalVariable(name: "Common", arg: 16, scope: !14, file: !1, line: 58, type: !71)
!120 = !DILocalVariable(name: "Lip", scope: !14, file: !1, line: 61, type: !5)
!121 = !DILocalVariable(name: "Llen", scope: !14, file: !1, line: 61, type: !5)
!122 = !DILocalVariable(name: "Uip", scope: !14, file: !1, line: 61, type: !5)
!123 = !DILocalVariable(name: "Ulen", scope: !14, file: !1, line: 61, type: !5)
!124 = !DILocalVariable(name: "Li2", scope: !14, file: !1, line: 61, type: !5)
!125 = !DILocalVariable(name: "Ui2", scope: !14, file: !1, line: 61, type: !5)
!126 = !DILocalVariable(name: "LU", scope: !14, file: !1, line: 62, type: !127)
!127 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !128, size: 64)
!128 = !DIDerivedType(tag: DW_TAG_typedef, name: "Unit", file: !129, line: 253, baseType: !8)
!129 = !DIFile(filename: "./klu_version.h", directory: "/Users/fak/Dropbox/Projects/SparsePerf/SparseSuite/SparseSuite")
!130 = !DILocalVariable(name: "Lx2", scope: !14, file: !1, line: 63, type: !7)
!131 = !DILocalVariable(name: "Ux2", scope: !14, file: !1, line: 63, type: !7)
!132 = !DILocalVariable(name: "Ukk", scope: !14, file: !1, line: 63, type: !7)
!133 = !DILocalVariable(name: "i", scope: !14, file: !1, line: 64, type: !6)
!134 = !DILocalVariable(name: "k", scope: !14, file: !1, line: 64, type: !6)
!135 = !DILocalVariable(name: "block", scope: !14, file: !1, line: 64, type: !6)
!136 = !DILocalVariable(name: "nblocks", scope: !14, file: !1, line: 64, type: !6)
!137 = !DILocalVariable(name: "n", scope: !14, file: !1, line: 64, type: !6)
!138 = !DILocalVariable(name: "nz", scope: !14, file: !1, line: 64, type: !6)
!139 = !DILocalVariable(name: "k1", scope: !14, file: !1, line: 64, type: !6)
!140 = !DILocalVariable(name: "k2", scope: !14, file: !1, line: 64, type: !6)
!141 = !DILocalVariable(name: "nk", scope: !14, file: !1, line: 64, type: !6)
!142 = !DILocalVariable(name: "len", scope: !14, file: !1, line: 64, type: !6)
!143 = !DILocalVariable(name: "kk", scope: !14, file: !1, line: 64, type: !6)
!144 = !DILocalVariable(name: "p", scope: !14, file: !1, line: 64, type: !6)
!145 = !DILocalVariable(name: "xp", scope: !146, file: !1, line: 183, type: !127)
!146 = distinct !DILexicalBlock(scope: !147, file: !1, line: 183, column: 21)
