; ModuleID = 'klu_analyze_given.c'
source_filename = "klu_analyze_given.c"
target datalayout = "e-m:o-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-apple-macosx10.14.0"

%struct.klu_symbolic = type { double, double, double, double, double*, i32, i32, i32*, i32*, i32*, i32, i32, i32, i32, i32, i32 }
%struct.klu_common_struct = type { double, double, double, double, double, i32, i32, i32, i32 (i32, i32*, i32*, i32*, %struct.klu_common_struct*)*, i8*, i32, i32, i32, i32, i32, i32, i32, double, double, double, double, double, i64, i64 }

; Function Attrs: nounwind ssp uwtable
define %struct.klu_symbolic* @klu_alloc_symbolic(i32, i32* readonly, i32* readonly, %struct.klu_common_struct*) local_unnamed_addr #0 !dbg !12 {
  %5 = alloca %struct.klu_symbolic*, align 8
  call void @llvm.dbg.value(metadata i32 %0, metadata !74, metadata !DIExpression()), !dbg !88
  call void @llvm.dbg.value(metadata i32* %1, metadata !75, metadata !DIExpression()), !dbg !89
  call void @llvm.dbg.value(metadata i32* %2, metadata !76, metadata !DIExpression()), !dbg !90
  call void @llvm.dbg.value(metadata %struct.klu_common_struct* %3, metadata !77, metadata !DIExpression()), !dbg !91
  %6 = bitcast %struct.klu_symbolic** %5 to i8*, !dbg !92
  call void @llvm.lifetime.start.p0i8(i64 8, i8* nonnull %6) #4, !dbg !92
  %7 = icmp eq %struct.klu_common_struct* %3, null, !dbg !93
  br i1 %7, label %110, label %8, !dbg !95

; <label>:8:                                      ; preds = %4

!0 = distinct !DICompileUnit(language: DW_LANG_C99, file: !1, producer: "Apple LLVM version 10.0.0 (clang-1000.11.45.5)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !2, retainedTypes: !3)
!1 = !DIFile(filename: "klu_analyze_given.c", directory: "/Users/fak/Dropbox/Projects/SparsePerf/SparseSuite/SparseSuite")
!2 = !{}
!3 = !{!4, !5}
!4 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!5 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !6, size: 64)
!6 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!7 = !{i32 2, !"Dwarf Version", i32 4}
!8 = !{i32 2, !"Debug Info Version", i32 3}
!9 = !{i32 1, !"wchar_size", i32 4}
!10 = !{i32 7, !"PIC Level", i32 2}
!11 = !{!"Apple LLVM version 10.0.0 (clang-1000.11.45.5)"}
!12 = distinct !DISubprogram(name: "klu_alloc_symbolic", scope: !1, file: !1, line: 17, type: !13, isLocal: false, isDefinition: true, scopeLine: 24, flags: DIFlagPrototyped, isOptimized: true, unit: !0, variables: !73)
!13 = !DISubroutineType(types: !14)
!14 = !{!15, !6, !5, !5, !38}
!15 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !16, size: 64)
!16 = !DIDerivedType(tag: DW_TAG_typedef, name: "klu_symbolic", file: !17, line: 54, baseType: !18)
!17 = !DIFile(filename: "./klu.h", directory: "/Users/fak/Dropbox/Projects/SparsePerf/SparseSuite/SparseSuite")
!18 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !17, line: 23, size: 768, elements: !19)
!19 = !{!20, !22, !23, !24, !25, !27, !28, !29, !30, !31, !32, !33, !34, !35, !36, !37}
!20 = !DIDerivedType(tag: DW_TAG_member, name: "symmetry", scope: !18, file: !17, line: 31, baseType: !21, size: 64)
!21 = !DIBasicType(name: "double", size: 64, encoding: DW_ATE_float)
!22 = !DIDerivedType(tag: DW_TAG_member, name: "est_flops", scope: !18, file: !17, line: 32, baseType: !21, size: 64, offset: 64)
!23 = !DIDerivedType(tag: DW_TAG_member, name: "lnz", scope: !18, file: !17, line: 33, baseType: !21, size: 64, offset: 128)
!24 = !DIDerivedType(tag: DW_TAG_member, name: "unz", scope: !18, file: !17, line: 33, baseType: !21, size: 64, offset: 192)
!25 = !DIDerivedType(tag: DW_TAG_member, name: "Lnz", scope: !18, file: !17, line: 34, baseType: !26, size: 64, offset: 256)
!26 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !21, size: 64)
!27 = !DIDerivedType(tag: DW_TAG_member, name: "n", scope: !18, file: !17, line: 38, baseType: !6, size: 32, offset: 320)
!28 = !DIDerivedType(tag: DW_TAG_member, name: "nz", scope: !18, file: !17, line: 39, baseType: !6, size: 32, offset: 352)
!29 = !DIDerivedType(tag: DW_TAG_member, name: "P", scope: !18, file: !17, line: 40, baseType: !5, size: 64, offset: 384)
!30 = !DIDerivedType(tag: DW_TAG_member, name: "Q", scope: !18, file: !17, line: 41, baseType: !5, size: 64, offset: 448)
!31 = !DIDerivedType(tag: DW_TAG_member, name: "R", scope: !18, file: !17, line: 42, baseType: !5, size: 64, offset: 512)
!32 = !DIDerivedType(tag: DW_TAG_member, name: "nzoff", scope: !18, file: !17, line: 43, baseType: !6, size: 32, offset: 576)
!33 = !DIDerivedType(tag: DW_TAG_member, name: "nblocks", scope: !18, file: !17, line: 44, baseType: !6, size: 32, offset: 608)
!34 = !DIDerivedType(tag: DW_TAG_member, name: "maxblock", scope: !18, file: !17, line: 45, baseType: !6, size: 32, offset: 640)
!35 = !DIDerivedType(tag: DW_TAG_member, name: "ordering", scope: !18, file: !17, line: 46, baseType: !6, size: 32, offset: 672)
!36 = !DIDerivedType(tag: DW_TAG_member, name: "do_btf", scope: !18, file: !17, line: 47, baseType: !6, size: 32, offset: 704)
!37 = !DIDerivedType(tag: DW_TAG_member, name: "structural_rank", scope: !18, file: !17, line: 50, baseType: !6, size: 32, offset: 736)
!38 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !39, size: 64)
!39 = !DIDerivedType(tag: DW_TAG_typedef, name: "klu_common", file: !17, line: 207, baseType: !40)
!40 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "klu_common_struct", file: !17, line: 137, size: 1280, elements: !41)
!41 = !{!42, !43, !44, !45, !46, !47, !48, !49, !50, !55, !56, !57, !58, !59, !60, !61, !62, !63, !64, !65, !66, !67, !68, !72}
!42 = !DIDerivedType(tag: DW_TAG_member, name: "tol", scope: !40, file: !17, line: 144, baseType: !21, size: 64)
!43 = !DIDerivedType(tag: DW_TAG_member, name: "memgrow", scope: !40, file: !17, line: 145, baseType: !21, size: 64, offset: 64)
!44 = !DIDerivedType(tag: DW_TAG_member, name: "initmem_amd", scope: !40, file: !17, line: 146, baseType: !21, size: 64, offset: 128)
!45 = !DIDerivedType(tag: DW_TAG_member, name: "initmem", scope: !40, file: !17, line: 147, baseType: !21, size: 64, offset: 192)
!46 = !DIDerivedType(tag: DW_TAG_member, name: "maxwork", scope: !40, file: !17, line: 148, baseType: !21, size: 64, offset: 256)
!47 = !DIDerivedType(tag: DW_TAG_member, name: "btf", scope: !40, file: !17, line: 150, baseType: !6, size: 32, offset: 320)
!48 = !DIDerivedType(tag: DW_TAG_member, name: "ordering", scope: !40, file: !17, line: 151, baseType: !6, size: 32, offset: 352)
!49 = !DIDerivedType(tag: DW_TAG_member, name: "scale", scope: !40, file: !17, line: 153, baseType: !6, size: 32, offset: 384)
!50 = !DIDerivedType(tag: DW_TAG_member, name: "user_order", scope: !40, file: !17, line: 157, baseType: !51, size: 64, offset: 448)
!51 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !52, size: 64)
!52 = !DISubroutineType(types: !53)
!53 = !{!6, !6, !5, !5, !5, !54}
!54 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !40, size: 64)
!55 = !DIDerivedType(tag: DW_TAG_member, name: "user_data", scope: !40, file: !17, line: 162, baseType: !4, size: 64, offset: 512)
!56 = !DIDerivedType(tag: DW_TAG_member, name: "halt_if_singular", scope: !40, file: !17, line: 164, baseType: !6, size: 32, offset: 576)
!57 = !DIDerivedType(tag: DW_TAG_member, name: "status", scope: !40, file: !17, line: 177, baseType: !6, size: 32, offset: 608)
!58 = !DIDerivedType(tag: DW_TAG_member, name: "nrealloc", scope: !40, file: !17, line: 178, baseType: !6, size: 32, offset: 640)
!59 = !DIDerivedType(tag: DW_TAG_member, name: "structural_rank", scope: !40, file: !17, line: 180, baseType: !6, size: 32, offset: 672)
!60 = !DIDerivedType(tag: DW_TAG_member, name: "numerical_rank", scope: !40, file: !17, line: 185, baseType: !6, size: 32, offset: 704)
!61 = !DIDerivedType(tag: DW_TAG_member, name: "singular_col", scope: !40, file: !17, line: 191, baseType: !6, size: 32, offset: 736)
!62 = !DIDerivedType(tag: DW_TAG_member, name: "noffdiag", scope: !40, file: !17, line: 196, baseType: !6, size: 32, offset: 768)
!63 = !DIDerivedType(tag: DW_TAG_member, name: "flops", scope: !40, file: !17, line: 198, baseType: !21, size: 64, offset: 832)
!64 = !DIDerivedType(tag: DW_TAG_member, name: "rcond", scope: !40, file: !17, line: 199, baseType: !21, size: 64, offset: 896)
!65 = !DIDerivedType(tag: DW_TAG_member, name: "condest", scope: !40, file: !17, line: 200, baseType: !21, size: 64, offset: 960)
!66 = !DIDerivedType(tag: DW_TAG_member, name: "rgrowth", scope: !40, file: !17, line: 201, baseType: !21, size: 64, offset: 1024)
!67 = !DIDerivedType(tag: DW_TAG_member, name: "work", scope: !40, file: !17, line: 202, baseType: !21, size: 64, offset: 1088)
!68 = !DIDerivedType(tag: DW_TAG_member, name: "memusage", scope: !40, file: !17, line: 204, baseType: !69, size: 64, offset: 1152)
!69 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !70, line: 62, baseType: !71)
!70 = !DIFile(filename: "/Applications/Xcode.app/Contents/Developer/Toolchains/XcodeDefault.xctoolchain/usr/lib/clang/10.0.0/include/stddef.h", directory: "/Users/fak/Dropbox/Projects/SparsePerf/SparseSuite/SparseSuite")
!71 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!72 = !DIDerivedType(tag: DW_TAG_member, name: "mempeak", scope: !40, file: !17, line: 205, baseType: !69, size: 64, offset: 1216)
!73 = !{!74, !75, !76, !77, !78, !79, !80, !81, !82, !83, !84, !85, !86, !87}
!74 = !DILocalVariable(name: "n", arg: 1, scope: !12, file: !1, line: 19, type: !6)
!75 = !DILocalVariable(name: "Ap", arg: 2, scope: !12, file: !1, line: 20, type: !5)
!76 = !DILocalVariable(name: "Ai", arg: 3, scope: !12, file: !1, line: 21, type: !5)
!77 = !DILocalVariable(name: "Common", arg: 4, scope: !12, file: !1, line: 22, type: !38)
!78 = !DILocalVariable(name: "Symbolic", scope: !12, file: !1, line: 25, type: !15)
!79 = !DILocalVariable(name: "P", scope: !12, file: !1, line: 26, type: !5)
!80 = !DILocalVariable(name: "Q", scope: !12, file: !1, line: 26, type: !5)
!81 = !DILocalVariable(name: "R", scope: !12, file: !1, line: 26, type: !5)
!82 = !DILocalVariable(name: "Lnz", scope: !12, file: !1, line: 27, type: !26)
!83 = !DILocalVariable(name: "nz", scope: !12, file: !1, line: 28, type: !6)
!84 = !DILocalVariable(name: "i", scope: !12, file: !1, line: 28, type: !6)
!85 = !DILocalVariable(name: "j", scope: !12, file: !1, line: 28, type: !6)
!86 = !DILocalVariable(name: "p", scope: !12, file: !1, line: 28, type: !6)
!87 = !DILocalVariable(name: "pend", scope: !12, file: !1, line: 28, type: !6)
!88 = !DILocation(line: 19, column: 9, scope: !12)
!89 = !DILocation(line: 20, column: 10, scope: !12)
!90 = !DILocation(line: 21, column: 10, scope: !12)
!91 = !DILocation(line: 22, column: 17, scope: !12)
!92 = !DILocation(line: 25, column: 5, scope: !12)
!93 = !DILocation(line: 30, column: 16, scope: !94)
!94 = distinct !DILexicalBlock(scope: !12, file: !1, line: 30, column: 9)
!95 = !DILocation(line: 30, column: 9, scope: !12)
!96 = !DILocation(line: 34, column: 13, scope: !12)
!97 = !DILocation(line: 34, column: 20, scope: !12)
!98 = !{!99, !103, i64 76}
!99 = !{!"klu_common_struct", !100, i64 0, !100, i64 8, !100, i64 16, !100, i64 24, !100, i64 32, !103, i64 40, !103, i64 44, !103, i64 48, !104, i64 56, !104, i64 64, !103, i64 72, !103, i64 76, !103, i64 80, !103, i64 84, !103, i64 88, !103, i64 92, !103, i64 96, !100, i64 104, !100, i64 112, !100, i64 120, !100, i64 128, !100, i64 136, !105, i64 144, !105, i64 152}
!100 = !{!"double", !101, i64 0}
!101 = !{!"omnipotent char", !102, i64 0}
!102 = !{!"Simple C/C++ TBAA"}
!103 = !{!"int", !101, i64 0}
!104 = !{!"any pointer", !101, i64 0}
!105 = !{!"long", !101, i64 0}
!106 = !DILocation(line: 42, column: 11, scope: !107)
!107 = distinct !DILexicalBlock(scope: !12, file: !1, line: 42, column: 9)
!108 = !DILocation(line: 42, column: 22, scope: !107)
!109 = !DILocation(line: 42, column: 16, scope: !107)
!110 = !DILocation(line: 42, column: 36, scope: !107)
!111 = !DILocation(line: 45, column: 24, scope: !112)
!112 = distinct !DILexicalBlock(scope: !107, file: !1, line: 43, column: 5)
!113 = !DILocation(line: 46, column: 9, scope: !112)
!114 = !DILocation(line: 49, column: 10, scope: !12)
!115 = !{!103, !103, i64 0}
!116 = !DILocation(line: 28, column: 9, scope: !12)
!117 = !DILocation(line: 50, column: 9, scope: !118)
!118 = distinct !DILexicalBlock(scope: !12, file: !1, line: 50, column: 9)
!119 = !DILocation(line: 50, column: 16, scope: !118)
!120 = !DILocation(line: 50, column: 27, scope: !118)
!121 = !DILocation(line: 50, column: 21, scope: !118)
!122 = !DILocation(line: 53, column: 24, scope: !123)
!123 = distinct !DILexicalBlock(scope: !118, file: !1, line: 51, column: 5)
!124 = !DILocation(line: 54, column: 9, scope: !123)
!125 = !DILocation(line: 28, column: 16, scope: !12)
!126 = !DILocation(line: 57, column: 5, scope: !127)
!127 = distinct !DILexicalBlock(scope: !12, file: !1, line: 57, column: 5)
!128 = !DILocation(line: 57, column: 20, scope: !129)
!129 = distinct !DILexicalBlock(scope: !127, file: !1, line: 57, column: 5)
!130 = distinct !{!130, !126, !131}
!131 = !DILocation(line: 65, column: 5, scope: !127)
!132 = !DILocation(line: 59, column: 13, scope: !133)
