; ModuleID = 'klu_sort.c'
source_filename = "klu_sort.c"
target datalayout = "e-m:o-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-apple-macosx10.14.0"

%struct.klu_symbolic = type { double, double, double, double, double*, i32, i32, i32*, i32*, i32*, i32, i32, i32, i32, i32, i32 }
%struct.klu_numeric = type { i32, i32, i32, i32, i32, i32, i32*, i32*, i32*, i32*, i32*, i32*, i8**, i64*, i8*, double*, i64, i8*, i8*, i32*, i32*, i32*, i8*, i32 }
%struct.klu_common_struct = type { double, double, double, double, double, i32, i32, i32, i32 (i32, i32*, i32*, i32*, %struct.klu_common_struct*)*, i8*, i32, i32, i32, i32, i32, i32, i32, double, double, double, double, double, i64, i64 }

; Function Attrs: nounwind ssp uwtable
define i32 @klu_sort(%struct.klu_symbolic* nocapture readonly, %struct.klu_numeric* nocapture readonly, %struct.klu_common_struct*) local_unnamed_addr #0 !dbg !21 {
  call void @llvm.dbg.value(metadata %struct.klu_symbolic* %0, metadata !108, metadata !DIExpression()), !dbg !129
  call void @llvm.dbg.value(metadata %struct.klu_numeric* %1, metadata !109, metadata !DIExpression()), !dbg !130
  call void @llvm.dbg.value(metadata %struct.klu_common_struct* %2, metadata !110, metadata !DIExpression()), !dbg !131
  %4 = icmp eq %struct.klu_common_struct* %2, null, !dbg !132
  br i1 %4, label %75, label %5, !dbg !134

; <label>:5:                                      ; preds = %3

!0 = distinct !DICompileUnit(language: DW_LANG_C99, file: !1, producer: "Apple LLVM version 10.0.0 (clang-1000.11.45.5)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !2, retainedTypes: !3)
!1 = !DIFile(filename: "klu_sort.c", directory: "/Users/fak/Dropbox/Projects/SparsePerf/SparseSuite/SparseSuite")
!2 = !{}
!3 = !{!4, !5, !10, !13, !15}
!4 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!5 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !6, size: 64)
!6 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !7, size: 64)
!7 = !DIDerivedType(tag: DW_TAG_typedef, name: "Unit", file: !8, line: 253, baseType: !9)
!8 = !DIFile(filename: "./klu_version.h", directory: "/Users/fak/Dropbox/Projects/SparsePerf/SparseSuite/SparseSuite")
!9 = !DIBasicType(name: "double", size: 64, encoding: DW_ATE_float)
!10 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !11, line: 62, baseType: !12)
!11 = !DIFile(filename: "/Applications/Xcode.app/Contents/Developer/Toolchains/XcodeDefault.xctoolchain/usr/lib/clang/10.0.0/include/stddef.h", directory: "/Users/fak/Dropbox/Projects/SparsePerf/SparseSuite/SparseSuite")
!12 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!13 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !14, size: 64)
!14 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!15 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !9, size: 64)
!16 = !{i32 2, !"Dwarf Version", i32 4}
!17 = !{i32 2, !"Debug Info Version", i32 3}
!18 = !{i32 1, !"wchar_size", i32 4}
!19 = !{i32 7, !"PIC Level", i32 2}
!20 = !{!"Apple LLVM version 10.0.0 (clang-1000.11.45.5)"}
!21 = distinct !DISubprogram(name: "klu_sort", scope: !1, file: !1, line: 91, type: !22, isLocal: false, isDefinition: true, scopeLine: 97, flags: DIFlagPrototyped, isOptimized: true, unit: !0, variables: !107)
!22 = !DISubroutineType(types: !23)
!23 = !{!14, !24, !45, !75}
!24 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !25, size: 64)
!25 = !DIDerivedType(tag: DW_TAG_typedef, name: "klu_symbolic", file: !26, line: 54, baseType: !27)
!26 = !DIFile(filename: "./klu.h", directory: "/Users/fak/Dropbox/Projects/SparsePerf/SparseSuite/SparseSuite")
!27 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !26, line: 23, size: 768, elements: !28)
!28 = !{!29, !30, !31, !32, !33, !34, !35, !36, !37, !38, !39, !40, !41, !42, !43, !44}
!29 = !DIDerivedType(tag: DW_TAG_member, name: "symmetry", scope: !27, file: !26, line: 31, baseType: !9, size: 64)
!30 = !DIDerivedType(tag: DW_TAG_member, name: "est_flops", scope: !27, file: !26, line: 32, baseType: !9, size: 64, offset: 64)
!31 = !DIDerivedType(tag: DW_TAG_member, name: "lnz", scope: !27, file: !26, line: 33, baseType: !9, size: 64, offset: 128)
!32 = !DIDerivedType(tag: DW_TAG_member, name: "unz", scope: !27, file: !26, line: 33, baseType: !9, size: 64, offset: 192)
!33 = !DIDerivedType(tag: DW_TAG_member, name: "Lnz", scope: !27, file: !26, line: 34, baseType: !15, size: 64, offset: 256)
!34 = !DIDerivedType(tag: DW_TAG_member, name: "n", scope: !27, file: !26, line: 38, baseType: !14, size: 32, offset: 320)
!35 = !DIDerivedType(tag: DW_TAG_member, name: "nz", scope: !27, file: !26, line: 39, baseType: !14, size: 32, offset: 352)
!36 = !DIDerivedType(tag: DW_TAG_member, name: "P", scope: !27, file: !26, line: 40, baseType: !13, size: 64, offset: 384)
!37 = !DIDerivedType(tag: DW_TAG_member, name: "Q", scope: !27, file: !26, line: 41, baseType: !13, size: 64, offset: 448)
!38 = !DIDerivedType(tag: DW_TAG_member, name: "R", scope: !27, file: !26, line: 42, baseType: !13, size: 64, offset: 512)
!39 = !DIDerivedType(tag: DW_TAG_member, name: "nzoff", scope: !27, file: !26, line: 43, baseType: !14, size: 32, offset: 576)
!40 = !DIDerivedType(tag: DW_TAG_member, name: "nblocks", scope: !27, file: !26, line: 44, baseType: !14, size: 32, offset: 608)
!41 = !DIDerivedType(tag: DW_TAG_member, name: "maxblock", scope: !27, file: !26, line: 45, baseType: !14, size: 32, offset: 640)
!42 = !DIDerivedType(tag: DW_TAG_member, name: "ordering", scope: !27, file: !26, line: 46, baseType: !14, size: 32, offset: 672)
!43 = !DIDerivedType(tag: DW_TAG_member, name: "do_btf", scope: !27, file: !26, line: 47, baseType: !14, size: 32, offset: 704)
!44 = !DIDerivedType(tag: DW_TAG_member, name: "structural_rank", scope: !27, file: !26, line: 50, baseType: !14, size: 32, offset: 736)
!45 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !46, size: 64)
!46 = !DIDerivedType(tag: DW_TAG_typedef, name: "klu_numeric", file: !26, line: 107, baseType: !47)
!47 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !26, line: 69, size: 1344, elements: !48)
!48 = !{!49, !50, !51, !52, !53, !54, !55, !56, !57, !58, !59, !60, !61, !63, !65, !66, !67, !68, !69, !70, !71, !72, !73, !74}
!49 = !DIDerivedType(tag: DW_TAG_member, name: "n", scope: !47, file: !26, line: 74, baseType: !14, size: 32)
!50 = !DIDerivedType(tag: DW_TAG_member, name: "nblocks", scope: !47, file: !26, line: 75, baseType: !14, size: 32, offset: 32)
!51 = !DIDerivedType(tag: DW_TAG_member, name: "lnz", scope: !47, file: !26, line: 76, baseType: !14, size: 32, offset: 64)
!52 = !DIDerivedType(tag: DW_TAG_member, name: "unz", scope: !47, file: !26, line: 77, baseType: !14, size: 32, offset: 96)
!53 = !DIDerivedType(tag: DW_TAG_member, name: "max_lnz_block", scope: !47, file: !26, line: 78, baseType: !14, size: 32, offset: 128)
!54 = !DIDerivedType(tag: DW_TAG_member, name: "max_unz_block", scope: !47, file: !26, line: 79, baseType: !14, size: 32, offset: 160)
!55 = !DIDerivedType(tag: DW_TAG_member, name: "Pnum", scope: !47, file: !26, line: 80, baseType: !13, size: 64, offset: 192)
!56 = !DIDerivedType(tag: DW_TAG_member, name: "Pinv", scope: !47, file: !26, line: 81, baseType: !13, size: 64, offset: 256)
!57 = !DIDerivedType(tag: DW_TAG_member, name: "Lip", scope: !47, file: !26, line: 84, baseType: !13, size: 64, offset: 320)
!58 = !DIDerivedType(tag: DW_TAG_member, name: "Uip", scope: !47, file: !26, line: 85, baseType: !13, size: 64, offset: 384)
!59 = !DIDerivedType(tag: DW_TAG_member, name: "Llen", scope: !47, file: !26, line: 86, baseType: !13, size: 64, offset: 448)
!60 = !DIDerivedType(tag: DW_TAG_member, name: "Ulen", scope: !47, file: !26, line: 87, baseType: !13, size: 64, offset: 512)
!61 = !DIDerivedType(tag: DW_TAG_member, name: "LUbx", scope: !47, file: !26, line: 88, baseType: !62, size: 64, offset: 576)
!62 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !4, size: 64)
!63 = !DIDerivedType(tag: DW_TAG_member, name: "LUsize", scope: !47, file: !26, line: 89, baseType: !64, size: 64, offset: 640)
!64 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !10, size: 64)
!65 = !DIDerivedType(tag: DW_TAG_member, name: "Udiag", scope: !47, file: !26, line: 90, baseType: !4, size: 64, offset: 704)
!66 = !DIDerivedType(tag: DW_TAG_member, name: "Rs", scope: !47, file: !26, line: 93, baseType: !15, size: 64, offset: 768)
!67 = !DIDerivedType(tag: DW_TAG_member, name: "worksize", scope: !47, file: !26, line: 96, baseType: !10, size: 64, offset: 832)
!68 = !DIDerivedType(tag: DW_TAG_member, name: "Work", scope: !47, file: !26, line: 97, baseType: !4, size: 64, offset: 896)
!69 = !DIDerivedType(tag: DW_TAG_member, name: "Xwork", scope: !47, file: !26, line: 98, baseType: !4, size: 64, offset: 960)
!70 = !DIDerivedType(tag: DW_TAG_member, name: "Iwork", scope: !47, file: !26, line: 99, baseType: !13, size: 64, offset: 1024)
!71 = !DIDerivedType(tag: DW_TAG_member, name: "Offp", scope: !47, file: !26, line: 102, baseType: !13, size: 64, offset: 1088)
!72 = !DIDerivedType(tag: DW_TAG_member, name: "Offi", scope: !47, file: !26, line: 103, baseType: !13, size: 64, offset: 1152)
!73 = !DIDerivedType(tag: DW_TAG_member, name: "Offx", scope: !47, file: !26, line: 104, baseType: !4, size: 64, offset: 1216)
!74 = !DIDerivedType(tag: DW_TAG_member, name: "nzoff", scope: !47, file: !26, line: 105, baseType: !14, size: 32, offset: 1280)
!75 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !76, size: 64)
!76 = !DIDerivedType(tag: DW_TAG_typedef, name: "klu_common", file: !26, line: 207, baseType: !77)
!77 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "klu_common_struct", file: !26, line: 137, size: 1280, elements: !78)
!78 = !{!79, !80, !81, !82, !83, !84, !85, !86, !87, !92, !93, !94, !95, !96, !97, !98, !99, !100, !101, !102, !103, !104, !105, !106}
!79 = !DIDerivedType(tag: DW_TAG_member, name: "tol", scope: !77, file: !26, line: 144, baseType: !9, size: 64)
!80 = !DIDerivedType(tag: DW_TAG_member, name: "memgrow", scope: !77, file: !26, line: 145, baseType: !9, size: 64, offset: 64)
!81 = !DIDerivedType(tag: DW_TAG_member, name: "initmem_amd", scope: !77, file: !26, line: 146, baseType: !9, size: 64, offset: 128)
!82 = !DIDerivedType(tag: DW_TAG_member, name: "initmem", scope: !77, file: !26, line: 147, baseType: !9, size: 64, offset: 192)
!83 = !DIDerivedType(tag: DW_TAG_member, name: "maxwork", scope: !77, file: !26, line: 148, baseType: !9, size: 64, offset: 256)
!84 = !DIDerivedType(tag: DW_TAG_member, name: "btf", scope: !77, file: !26, line: 150, baseType: !14, size: 32, offset: 320)
!85 = !DIDerivedType(tag: DW_TAG_member, name: "ordering", scope: !77, file: !26, line: 151, baseType: !14, size: 32, offset: 352)
!86 = !DIDerivedType(tag: DW_TAG_member, name: "scale", scope: !77, file: !26, line: 153, baseType: !14, size: 32, offset: 384)
!87 = !DIDerivedType(tag: DW_TAG_member, name: "user_order", scope: !77, file: !26, line: 157, baseType: !88, size: 64, offset: 448)
!88 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !89, size: 64)
!89 = !DISubroutineType(types: !90)
!90 = !{!14, !14, !13, !13, !13, !91}
!91 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !77, size: 64)
!92 = !DIDerivedType(tag: DW_TAG_member, name: "user_data", scope: !77, file: !26, line: 162, baseType: !4, size: 64, offset: 512)
!93 = !DIDerivedType(tag: DW_TAG_member, name: "halt_if_singular", scope: !77, file: !26, line: 164, baseType: !14, size: 32, offset: 576)
!94 = !DIDerivedType(tag: DW_TAG_member, name: "status", scope: !77, file: !26, line: 177, baseType: !14, size: 32, offset: 608)
!95 = !DIDerivedType(tag: DW_TAG_member, name: "nrealloc", scope: !77, file: !26, line: 178, baseType: !14, size: 32, offset: 640)
!96 = !DIDerivedType(tag: DW_TAG_member, name: "structural_rank", scope: !77, file: !26, line: 180, baseType: !14, size: 32, offset: 672)
!97 = !DIDerivedType(tag: DW_TAG_member, name: "numerical_rank", scope: !77, file: !26, line: 185, baseType: !14, size: 32, offset: 704)
!98 = !DIDerivedType(tag: DW_TAG_member, name: "singular_col", scope: !77, file: !26, line: 191, baseType: !14, size: 32, offset: 736)
!99 = !DIDerivedType(tag: DW_TAG_member, name: "noffdiag", scope: !77, file: !26, line: 196, baseType: !14, size: 32, offset: 768)
!100 = !DIDerivedType(tag: DW_TAG_member, name: "flops", scope: !77, file: !26, line: 198, baseType: !9, size: 64, offset: 832)
!101 = !DIDerivedType(tag: DW_TAG_member, name: "rcond", scope: !77, file: !26, line: 199, baseType: !9, size: 64, offset: 896)
!102 = !DIDerivedType(tag: DW_TAG_member, name: "condest", scope: !77, file: !26, line: 200, baseType: !9, size: 64, offset: 960)
!103 = !DIDerivedType(tag: DW_TAG_member, name: "rgrowth", scope: !77, file: !26, line: 201, baseType: !9, size: 64, offset: 1024)
!104 = !DIDerivedType(tag: DW_TAG_member, name: "work", scope: !77, file: !26, line: 202, baseType: !9, size: 64, offset: 1088)
!105 = !DIDerivedType(tag: DW_TAG_member, name: "memusage", scope: !77, file: !26, line: 204, baseType: !10, size: 64, offset: 1152)
!106 = !DIDerivedType(tag: DW_TAG_member, name: "mempeak", scope: !77, file: !26, line: 205, baseType: !10, size: 64, offset: 1216)
!107 = !{!108, !109, !110, !111, !112, !113, !114, !115, !116, !117, !118, !119, !120, !121, !122, !123, !124, !125, !126, !127, !128}
!108 = !DILocalVariable(name: "Symbolic", arg: 1, scope: !21, file: !1, line: 93, type: !24)
!109 = !DILocalVariable(name: "Numeric", arg: 2, scope: !21, file: !1, line: 94, type: !45)
!110 = !DILocalVariable(name: "Common", arg: 3, scope: !21, file: !1, line: 95, type: !75)
!111 = !DILocalVariable(name: "R", scope: !21, file: !1, line: 98, type: !13)
!112 = !DILocalVariable(name: "W", scope: !21, file: !1, line: 98, type: !13)
!113 = !DILocalVariable(name: "Tp", scope: !21, file: !1, line: 98, type: !13)
!114 = !DILocalVariable(name: "Ti", scope: !21, file: !1, line: 98, type: !13)
!115 = !DILocalVariable(name: "Lip", scope: !21, file: !1, line: 98, type: !13)
!116 = !DILocalVariable(name: "Uip", scope: !21, file: !1, line: 98, type: !13)
!117 = !DILocalVariable(name: "Llen", scope: !21, file: !1, line: 98, type: !13)
!118 = !DILocalVariable(name: "Ulen", scope: !21, file: !1, line: 98, type: !13)
!119 = !DILocalVariable(name: "Tx", scope: !21, file: !1, line: 99, type: !15)
!120 = !DILocalVariable(name: "LUbx", scope: !21, file: !1, line: 100, type: !5)
!121 = !DILocalVariable(name: "n", scope: !21, file: !1, line: 101, type: !14)
!122 = !DILocalVariable(name: "nk", scope: !21, file: !1, line: 101, type: !14)
!123 = !DILocalVariable(name: "nz", scope: !21, file: !1, line: 101, type: !14)
!124 = !DILocalVariable(name: "block", scope: !21, file: !1, line: 101, type: !14)
!125 = !DILocalVariable(name: "nblocks", scope: !21, file: !1, line: 101, type: !14)
!126 = !DILocalVariable(name: "maxblock", scope: !21, file: !1, line: 101, type: !14)
!127 = !DILocalVariable(name: "k1", scope: !21, file: !1, line: 101, type: !14)
!128 = !DILocalVariable(name: "m1", scope: !21, file: !1, line: 102, type: !10)
!129 = !DILocation(line: 93, column: 19, scope: !21)
!130 = !DILocation(line: 94, column: 18, scope: !21)
!131 = !DILocation(line: 95, column: 17, scope: !21)
!132 = !DILocation(line: 104, column: 16, scope: !133)
!133 = distinct !DILexicalBlock(scope: !21, file: !1, line: 104, column: 9)
!134 = !DILocation(line: 104, column: 9, scope: !21)
!135 = !DILocation(line: 108, column: 13, scope: !21)
!136 = !DILocation(line: 108, column: 20, scope: !21)
!137 = !{!138, !142, i64 76}
!138 = !{!"klu_common_struct", !139, i64 0, !139, i64 8, !139, i64 16, !139, i64 24, !139, i64 32, !142, i64 40, !142, i64 44, !142, i64 48, !143, i64 56, !143, i64 64, !142, i64 72, !142, i64 76, !142, i64 80, !142, i64 84, !142, i64 88, !142, i64 92, !142, i64 96, !139, i64 104, !139, i64 112, !139, i64 120, !139, i64 128, !139, i64 136, !144, i64 144, !144, i64 152}
!139 = !{!"double", !140, i64 0}
!140 = !{!"omnipotent char", !141, i64 0}
!141 = !{!"Simple C/C++ TBAA"}
!142 = !{!"int", !140, i64 0}
!143 = !{!"any pointer", !140, i64 0}
!144 = !{!"long", !140, i64 0}
!145 = !DILocation(line: 101, column: 9, scope: !21)
!146 = !DILocation(line: 111, column: 19, scope: !21)
!147 = !{!148, !143, i64 64}
!148 = !{!"", !139, i64 0, !139, i64 8, !139, i64 16, !139, i64 24, !143, i64 32, !142, i64 40, !142, i64 44, !143, i64 48, !143, i64 56, !143, i64 64, !142, i64 72, !142, i64 76, !142, i64 80, !142, i64 84, !142, i64 88, !142, i64 92}
!149 = !DILocation(line: 98, column: 10, scope: !21)
!150 = !DILocation(line: 112, column: 25, scope: !21)
!151 = !{!148, !142, i64 76}
!152 = !DILocation(line: 101, column: 27, scope: !21)
!153 = !DILocation(line: 113, column: 26, scope: !21)
!154 = !{!148, !142, i64 80}
!155 = !DILocation(line: 101, column: 36, scope: !21)
!156 = !DILocation(line: 115, column: 21, scope: !21)
!157 = !{!158, !143, i64 40}
