; ModuleID = 'klu_memory.c'
source_filename = "klu_memory.c"
target datalayout = "e-m:o-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-apple-macosx10.14.0"

%struct.klu_common_struct = type { double, double, double, double, double, i32, i32, i32, i32 (i32, i32*, i32*, i32*, %struct.klu_common_struct*)*, i8*, i32, i32, i32, i32, i32, i32, i32, double, double, double, double, double, i64, i64 }

; Function Attrs: nounwind ssp uwtable
define i64 @klu_add_size_t(i64, i64, i32* nocapture) local_unnamed_addr #0 !dbg !13 {
  call void @llvm.dbg.value(metadata i64 %0, metadata !19, metadata !DIExpression()), !dbg !22
  call void @llvm.dbg.value(metadata i64 %1, metadata !20, metadata !DIExpression()), !dbg !23
  call void @llvm.dbg.value(metadata i32* %2, metadata !21, metadata !DIExpression()), !dbg !24
  %4 = load i32, i32* %2, align 4, !dbg !25, !tbaa !26
  %5 = icmp eq i32 %4, 0, !dbg !30
  br i1 %5, label %6, label %7, !dbg !31

; <label>:6:                                      ; preds = %3
  store i32 0, i32* %2, align 4, !dbg !32, !tbaa !26
  ret i64 -1, !dbg !33

; <label>:7:                                      ; preds = %3
  %8 = add i64 %1, %0, !dbg !34
  %9 = icmp ugt i64 %0, %1, !dbg !35
  %10 = select i1 %9, i64 %0, i64 %1, !dbg !35
  %11 = icmp uge i64 %8, %10, !dbg !36
  %12 = zext i1 %11 to i32, !dbg !31
  store i32 %12, i32* %2, align 4, !dbg !32, !tbaa !26
  %13 = add i64 %1, %0, !dbg !37
  %14 = select i1 %11, i64 %13, i64 -1, !dbg !38

!0 = distinct !DICompileUnit(language: DW_LANG_C99, file: !1, producer: "Apple LLVM version 10.0.0 (clang-1000.11.45.5)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !2, retainedTypes: !3)
!1 = !DIFile(filename: "klu_memory.c", directory: "/Users/fak/Dropbox/Projects/SparsePerf/SparseSuite/SparseSuite")
!2 = !{}
!3 = !{!4, !7}
!4 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !5, line: 62, baseType: !6)
!5 = !DIFile(filename: "/Applications/Xcode.app/Contents/Developer/Toolchains/XcodeDefault.xctoolchain/usr/lib/clang/10.0.0/include/stddef.h", directory: "/Users/fak/Dropbox/Projects/SparsePerf/SparseSuite/SparseSuite")
!6 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!7 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!8 = !{i32 2, !"Dwarf Version", i32 4}
!9 = !{i32 2, !"Debug Info Version", i32 3}
!10 = !{i32 1, !"wchar_size", i32 4}
!11 = !{i32 7, !"PIC Level", i32 2}
!12 = !{!"Apple LLVM version 10.0.0 (clang-1000.11.45.5)"}
!13 = distinct !DISubprogram(name: "klu_add_size_t", scope: !1, file: !1, line: 20, type: !14, isLocal: false, isDefinition: true, scopeLine: 21, flags: DIFlagPrototyped, isOptimized: true, unit: !0, variables: !18)
!14 = !DISubroutineType(types: !15)
!15 = !{!4, !4, !4, !16}
!16 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !17, size: 64)
!17 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!18 = !{!19, !20, !21}
!19 = !DILocalVariable(name: "a", arg: 1, scope: !13, file: !1, line: 20, type: !4)
!20 = !DILocalVariable(name: "b", arg: 2, scope: !13, file: !1, line: 20, type: !4)
!21 = !DILocalVariable(name: "ok", arg: 3, scope: !13, file: !1, line: 20, type: !16)
!22 = !DILocation(line: 20, column: 31, scope: !13)
!23 = !DILocation(line: 20, column: 41, scope: !13)
!24 = !DILocation(line: 20, column: 49, scope: !13)
!25 = !DILocation(line: 22, column: 14, scope: !13)
!26 = !{!27, !27, i64 0}
!27 = !{!"int", !28, i64 0}
!28 = !{!"omnipotent char", !29, i64 0}
!29 = !{!"Simple C/C++ TBAA"}
!30 = !DILocation(line: 22, column: 13, scope: !13)
!31 = !DILocation(line: 22, column: 19, scope: !13)
!32 = !DILocation(line: 22, column: 11, scope: !13)
!33 = !DILocation(line: 23, column: 5, scope: !13)
!34 = !DILocation(line: 22, column: 26, scope: !13)
!35 = !DILocation(line: 22, column: 34, scope: !13)
!36 = !DILocation(line: 22, column: 31, scope: !13)
!37 = !DILocation(line: 23, column: 24, scope: !13)
!38 = !DILocation(line: 23, column: 13, scope: !13)
!39 = distinct !DISubprogram(name: "klu_mult_size_t", scope: !1, file: !1, line: 32, type: !14, isLocal: false, isDefinition: true, scopeLine: 33, flags: DIFlagPrototyped, isOptimized: true, unit: !0, variables: !40)
!40 = !{!41, !42, !43, !44, !45}
!41 = !DILocalVariable(name: "a", arg: 1, scope: !39, file: !1, line: 32, type: !4)
!42 = !DILocalVariable(name: "k", arg: 2, scope: !39, file: !1, line: 32, type: !4)
!43 = !DILocalVariable(name: "ok", arg: 3, scope: !39, file: !1, line: 32, type: !16)
!44 = !DILocalVariable(name: "i", scope: !39, file: !1, line: 34, type: !4)
!45 = !DILocalVariable(name: "s", scope: !39, file: !1, line: 34, type: !4)
!46 = !DILocation(line: 32, column: 32, scope: !39)
!47 = !DILocation(line: 32, column: 42, scope: !39)
!48 = !DILocation(line: 32, column: 50, scope: !39)
!49 = !DILocation(line: 34, column: 15, scope: !39)
!50 = !DILocation(line: 34, column: 12, scope: !39)
!51 = !DILocation(line: 35, column: 20, scope: !52)
!52 = distinct !DILexicalBlock(scope: !53, file: !1, line: 35, column: 5)
!53 = distinct !DILexicalBlock(scope: !39, file: !1, line: 35, column: 5)
!54 = !DILocation(line: 35, column: 5, scope: !53)
!55 = !DILocation(line: 37, column: 13, scope: !56)
!56 = distinct !DILexicalBlock(scope: !52, file: !1, line: 36, column: 5)
!57 = !DILocation(line: 35, column: 27, scope: !52)
!58 = distinct !{!58, !54, !59}
!59 = !DILocation(line: 38, column: 5, scope: !53)
!60 = !DILocation(line: 39, column: 14, scope: !39)
!61 = !DILocation(line: 39, column: 13, scope: !39)
!62 = !DILocation(line: 39, column: 5, scope: !39)
!63 = distinct !DISubprogram(name: "klu_malloc", scope: !1, file: !1, line: 60, type: !64, isLocal: false, isDefinition: true, scopeLine: 68, flags: DIFlagPrototyped, isOptimized: true, unit: !0, variables: !100)
!64 = !DISubroutineType(types: !65)
!65 = !{!7, !4, !4, !66}
!66 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !67, size: 64)
!67 = !DIDerivedType(tag: DW_TAG_typedef, name: "klu_common", file: !68, line: 207, baseType: !69)
!68 = !DIFile(filename: "./klu.h", directory: "/Users/fak/Dropbox/Projects/SparsePerf/SparseSuite/SparseSuite")
!69 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "klu_common_struct", file: !68, line: 137, size: 1280, elements: !70)
!70 = !{!71, !73, !74, !75, !76, !77, !78, !79, !80, !85, !86, !87, !88, !89, !90, !91, !92, !93, !94, !95, !96, !97, !98, !99}
!71 = !DIDerivedType(tag: DW_TAG_member, name: "tol", scope: !69, file: !68, line: 144, baseType: !72, size: 64)
!72 = !DIBasicType(name: "double", size: 64, encoding: DW_ATE_float)
!73 = !DIDerivedType(tag: DW_TAG_member, name: "memgrow", scope: !69, file: !68, line: 145, baseType: !72, size: 64, offset: 64)
!74 = !DIDerivedType(tag: DW_TAG_member, name: "initmem_amd", scope: !69, file: !68, line: 146, baseType: !72, size: 64, offset: 128)
!75 = !DIDerivedType(tag: DW_TAG_member, name: "initmem", scope: !69, file: !68, line: 147, baseType: !72, size: 64, offset: 192)
!76 = !DIDerivedType(tag: DW_TAG_member, name: "maxwork", scope: !69, file: !68, line: 148, baseType: !72, size: 64, offset: 256)
!77 = !DIDerivedType(tag: DW_TAG_member, name: "btf", scope: !69, file: !68, line: 150, baseType: !17, size: 32, offset: 320)
!78 = !DIDerivedType(tag: DW_TAG_member, name: "ordering", scope: !69, file: !68, line: 151, baseType: !17, size: 32, offset: 352)
!79 = !DIDerivedType(tag: DW_TAG_member, name: "scale", scope: !69, file: !68, line: 153, baseType: !17, size: 32, offset: 384)
!80 = !DIDerivedType(tag: DW_TAG_member, name: "user_order", scope: !69, file: !68, line: 157, baseType: !81, size: 64, offset: 448)
!81 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !82, size: 64)
!82 = !DISubroutineType(types: !83)
!83 = !{!17, !17, !16, !16, !16, !84}
!84 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !69, size: 64)
!85 = !DIDerivedType(tag: DW_TAG_member, name: "user_data", scope: !69, file: !68, line: 162, baseType: !7, size: 64, offset: 512)
!86 = !DIDerivedType(tag: DW_TAG_member, name: "halt_if_singular", scope: !69, file: !68, line: 164, baseType: !17, size: 32, offset: 576)
!87 = !DIDerivedType(tag: DW_TAG_member, name: "status", scope: !69, file: !68, line: 177, baseType: !17, size: 32, offset: 608)
!88 = !DIDerivedType(tag: DW_TAG_member, name: "nrealloc", scope: !69, file: !68, line: 178, baseType: !17, size: 32, offset: 640)
!89 = !DIDerivedType(tag: DW_TAG_member, name: "structural_rank", scope: !69, file: !68, line: 180, baseType: !17, size: 32, offset: 672)
!90 = !DIDerivedType(tag: DW_TAG_member, name: "numerical_rank", scope: !69, file: !68, line: 185, baseType: !17, size: 32, offset: 704)
!91 = !DIDerivedType(tag: DW_TAG_member, name: "singular_col", scope: !69, file: !68, line: 191, baseType: !17, size: 32, offset: 736)
!92 = !DIDerivedType(tag: DW_TAG_member, name: "noffdiag", scope: !69, file: !68, line: 196, baseType: !17, size: 32, offset: 768)
!93 = !DIDerivedType(tag: DW_TAG_member, name: "flops", scope: !69, file: !68, line: 198, baseType: !72, size: 64, offset: 832)
!94 = !DIDerivedType(tag: DW_TAG_member, name: "rcond", scope: !69, file: !68, line: 199, baseType: !72, size: 64, offset: 896)
!95 = !DIDerivedType(tag: DW_TAG_member, name: "condest", scope: !69, file: !68, line: 200, baseType: !72, size: 64, offset: 960)
!96 = !DIDerivedType(tag: DW_TAG_member, name: "rgrowth", scope: !69, file: !68, line: 201, baseType: !72, size: 64, offset: 1024)
!97 = !DIDerivedType(tag: DW_TAG_member, name: "work", scope: !69, file: !68, line: 202, baseType: !72, size: 64, offset: 1088)
!98 = !DIDerivedType(tag: DW_TAG_member, name: "memusage", scope: !69, file: !68, line: 204, baseType: !4, size: 64, offset: 1152)
!99 = !DIDerivedType(tag: DW_TAG_member, name: "mempeak", scope: !69, file: !68, line: 205, baseType: !4, size: 64, offset: 1216)
!100 = !{!101, !102, !103, !104}
!101 = !DILocalVariable(name: "n", arg: 1, scope: !63, file: !1, line: 63, type: !4)
!102 = !DILocalVariable(name: "size", arg: 2, scope: !63, file: !1, line: 64, type: !4)
!103 = !DILocalVariable(name: "Common", arg: 3, scope: !63, file: !1, line: 66, type: !66)
!104 = !DILocalVariable(name: "p", scope: !63, file: !1, line: 69, type: !7)
!105 = !DILocation(line: 63, column: 12, scope: !63)
!106 = !DILocation(line: 64, column: 12, scope: !63)
!107 = !DILocation(line: 66, column: 17, scope: !63)
!108 = !DILocation(line: 71, column: 16, scope: !109)
!109 = distinct !DILexicalBlock(scope: !63, file: !1, line: 71, column: 9)
!110 = !DILocation(line: 71, column: 9, scope: !63)
!111 = !DILocation(line: 75, column: 19, scope: !112)
!112 = distinct !DILexicalBlock(scope: !109, file: !1, line: 75, column: 14)
!113 = !DILocation(line: 75, column: 14, scope: !109)
!114 = !DILocation(line: 78, column: 17, scope: !115)
!115 = distinct !DILexicalBlock(scope: !112, file: !1, line: 76, column: 5)
!116 = !DILocation(line: 78, column: 24, scope: !115)
!117 = !{!118, !27, i64 76}
!118 = !{!"klu_common_struct", !119, i64 0, !119, i64 8, !119, i64 16, !119, i64 24, !119, i64 32, !27, i64 40, !27, i64 44, !27, i64 48, !120, i64 56, !120, i64 64, !27, i64 72, !27, i64 76, !27, i64 80, !27, i64 84, !27, i64 88, !27, i64 92, !27, i64 96, !119, i64 104, !119, i64 112, !119, i64 120, !119, i64 128, !119, i64 136, !121, i64 144, !121, i64 152}
!119 = !{!"double", !28, i64 0}
!120 = !{!"any pointer", !28, i64 0}
!121 = !{!"long", !28, i64 0}
!122 = !DILocation(line: 69, column: 11, scope: !63)
!123 = !DILocation(line: 80, column: 5, scope: !115)
!124 = !DILocation(line: 81, column: 16, scope: !125)
!125 = distinct !DILexicalBlock(scope: !112, file: !1, line: 81, column: 14)
!126 = !DILocation(line: 81, column: 14, scope: !112)
!127 = !DILocation(line: 85, column: 17, scope: !128)
!128 = distinct !DILexicalBlock(scope: !125, file: !1, line: 82, column: 5)
!129 = !DILocation(line: 85, column: 24, scope: !128)
!130 = !DILocation(line: 87, column: 5, scope: !128)
!131 = !DILocation(line: 91, column: 13, scope: !132)
!132 = distinct !DILexicalBlock(scope: !125, file: !1, line: 89, column: 5)
!133 = !DILocation(line: 92, column: 15, scope: !134)
!134 = distinct !DILexicalBlock(scope: !132, file: !1, line: 92, column: 13)
!135 = !DILocation(line: 92, column: 13, scope: !132)
!136 = !DILocation(line: 95, column: 21, scope: !137)
!137 = distinct !DILexicalBlock(scope: !134, file: !1, line: 93, column: 9)
!138 = !DILocation(line: 95, column: 28, scope: !137)
!139 = !DILocation(line: 96, column: 9, scope: !137)
!140 = !DILocation(line: 99, column: 34, scope: !141)
!141 = distinct !DILexicalBlock(scope: !134, file: !1, line: 98, column: 9)
!142 = !DILocation(line: 99, column: 44, scope: !141)
!143 = !DILocation(line: 99, column: 21, scope: !141)
!144 = !DILocation(line: 99, column: 30, scope: !141)
!145 = !{!118, !121, i64 144}
!146 = !DILocation(line: 100, column: 31, scope: !141)
!147 = !{!118, !121, i64 152}
!148 = !DILocation(line: 100, column: 29, scope: !141)
!149 = !DILocation(line: 0, scope: !132)
!150 = !DILocation(line: 103, column: 5, scope: !63)
!151 = distinct !DISubprogram(name: "klu_free", scope: !1, file: !1, line: 117, type: !152, isLocal: false, isDefinition: true, scopeLine: 127, flags: DIFlagPrototyped, isOptimized: true, unit: !0, variables: !154)
!152 = !DISubroutineType(types: !153)
!153 = !{!7, !7, !4, !4, !66}
!154 = !{!155, !156, !157, !158}
!155 = !DILocalVariable(name: "p", arg: 1, scope: !151, file: !1, line: 120, type: !7)
!156 = !DILocalVariable(name: "n", arg: 2, scope: !151, file: !1, line: 122, type: !4)
!157 = !DILocalVariable(name: "size", arg: 3, scope: !151, file: !1, line: 123, type: !4)
!158 = !DILocalVariable(name: "Common", arg: 4, scope: !151, file: !1, line: 125, type: !66)
