; ModuleID = 'klu_scale.c'
source_filename = "klu_scale.c"
target datalayout = "e-m:o-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-apple-macosx10.14.0"

%struct.klu_common_struct = type { double, double, double, double, double, i32, i32, i32, i32 (i32, i32*, i32*, i32*, %struct.klu_common_struct*)*, i8*, i32, i32, i32, i32, i32, i32, i32, double, double, double, double, double, i64, i64 }

; Function Attrs: nounwind ssp uwtable
define i32 @klu_scale(i32, i32, i32* readonly, i32* readonly, double* readonly, double*, i32*, %struct.klu_common_struct*) local_unnamed_addr #0 !dbg !14 {
  call void @llvm.dbg.value(metadata i32 %0, metadata !54, metadata !DIExpression()), !dbg !69
  call void @llvm.dbg.value(metadata i32 %1, metadata !55, metadata !DIExpression()), !dbg !70
  call void @llvm.dbg.value(metadata i32* %2, metadata !56, metadata !DIExpression()), !dbg !71
  call void @llvm.dbg.value(metadata i32* %3, metadata !57, metadata !DIExpression()), !dbg !72
  call void @llvm.dbg.value(metadata double* %4, metadata !58, metadata !DIExpression()), !dbg !73
  call void @llvm.dbg.value(metadata double* %5, metadata !59, metadata !DIExpression()), !dbg !74
  call void @llvm.dbg.value(metadata i32* %6, metadata !60, metadata !DIExpression()), !dbg !75
  call void @llvm.dbg.value(metadata %struct.klu_common_struct* %7, metadata !61, metadata !DIExpression()), !dbg !76
  %9 = bitcast i32* %6 to i8*
  %10 = bitcast double* %5 to i8*

!0 = distinct !DICompileUnit(language: DW_LANG_C99, file: !1, producer: "Apple LLVM version 10.0.0 (clang-1000.11.45.5)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !2, retainedTypes: !3)
!1 = !DIFile(filename: "klu_scale.c", directory: "/Users/fak/Dropbox/Projects/SparsePerf/SparseSuite/SparseSuite")
!2 = !{}
!3 = !{!4, !5, !7}
!4 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!5 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !6, size: 64)
!6 = !DIBasicType(name: "double", size: 64, encoding: DW_ATE_float)
!7 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !8, size: 64)
!8 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!9 = !{i32 2, !"Dwarf Version", i32 4}
!10 = !{i32 2, !"Debug Info Version", i32 3}
!11 = !{i32 1, !"wchar_size", i32 4}
!12 = !{i32 7, !"PIC Level", i32 2}
!13 = !{!"Apple LLVM version 10.0.0 (clang-1000.11.45.5)"}
!14 = distinct !DISubprogram(name: "klu_scale", scope: !1, file: !1, line: 19, type: !15, isLocal: false, isDefinition: true, scopeLine: 34, flags: DIFlagPrototyped, isOptimized: true, unit: !0, variables: !53)
!15 = !DISubroutineType(types: !16)
!16 = !{!8, !8, !8, !7, !7, !5, !5, !7, !17}
!17 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !18, size: 64)
!18 = !DIDerivedType(tag: DW_TAG_typedef, name: "klu_common", file: !19, line: 207, baseType: !20)
!19 = !DIFile(filename: "./klu.h", directory: "/Users/fak/Dropbox/Projects/SparsePerf/SparseSuite/SparseSuite")
!20 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "klu_common_struct", file: !19, line: 137, size: 1280, elements: !21)
!21 = !{!22, !23, !24, !25, !26, !27, !28, !29, !30, !35, !36, !37, !38, !39, !40, !41, !42, !43, !44, !45, !46, !47, !48, !52}
!22 = !DIDerivedType(tag: DW_TAG_member, name: "tol", scope: !20, file: !19, line: 144, baseType: !6, size: 64)
!23 = !DIDerivedType(tag: DW_TAG_member, name: "memgrow", scope: !20, file: !19, line: 145, baseType: !6, size: 64, offset: 64)
!24 = !DIDerivedType(tag: DW_TAG_member, name: "initmem_amd", scope: !20, file: !19, line: 146, baseType: !6, size: 64, offset: 128)
!25 = !DIDerivedType(tag: DW_TAG_member, name: "initmem", scope: !20, file: !19, line: 147, baseType: !6, size: 64, offset: 192)
!26 = !DIDerivedType(tag: DW_TAG_member, name: "maxwork", scope: !20, file: !19, line: 148, baseType: !6, size: 64, offset: 256)
!27 = !DIDerivedType(tag: DW_TAG_member, name: "btf", scope: !20, file: !19, line: 150, baseType: !8, size: 32, offset: 320)
!28 = !DIDerivedType(tag: DW_TAG_member, name: "ordering", scope: !20, file: !19, line: 151, baseType: !8, size: 32, offset: 352)
!29 = !DIDerivedType(tag: DW_TAG_member, name: "scale", scope: !20, file: !19, line: 153, baseType: !8, size: 32, offset: 384)
!30 = !DIDerivedType(tag: DW_TAG_member, name: "user_order", scope: !20, file: !19, line: 157, baseType: !31, size: 64, offset: 448)
!31 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !32, size: 64)
!32 = !DISubroutineType(types: !33)
!33 = !{!8, !8, !7, !7, !7, !34}
!34 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !20, size: 64)
!35 = !DIDerivedType(tag: DW_TAG_member, name: "user_data", scope: !20, file: !19, line: 162, baseType: !4, size: 64, offset: 512)
!36 = !DIDerivedType(tag: DW_TAG_member, name: "halt_if_singular", scope: !20, file: !19, line: 164, baseType: !8, size: 32, offset: 576)
!37 = !DIDerivedType(tag: DW_TAG_member, name: "status", scope: !20, file: !19, line: 177, baseType: !8, size: 32, offset: 608)
!38 = !DIDerivedType(tag: DW_TAG_member, name: "nrealloc", scope: !20, file: !19, line: 178, baseType: !8, size: 32, offset: 640)
!39 = !DIDerivedType(tag: DW_TAG_member, name: "structural_rank", scope: !20, file: !19, line: 180, baseType: !8, size: 32, offset: 672)
!40 = !DIDerivedType(tag: DW_TAG_member, name: "numerical_rank", scope: !20, file: !19, line: 185, baseType: !8, size: 32, offset: 704)
!41 = !DIDerivedType(tag: DW_TAG_member, name: "singular_col", scope: !20, file: !19, line: 191, baseType: !8, size: 32, offset: 736)
!42 = !DIDerivedType(tag: DW_TAG_member, name: "noffdiag", scope: !20, file: !19, line: 196, baseType: !8, size: 32, offset: 768)
!43 = !DIDerivedType(tag: DW_TAG_member, name: "flops", scope: !20, file: !19, line: 198, baseType: !6, size: 64, offset: 832)
!44 = !DIDerivedType(tag: DW_TAG_member, name: "rcond", scope: !20, file: !19, line: 199, baseType: !6, size: 64, offset: 896)
!45 = !DIDerivedType(tag: DW_TAG_member, name: "condest", scope: !20, file: !19, line: 200, baseType: !6, size: 64, offset: 960)
!46 = !DIDerivedType(tag: DW_TAG_member, name: "rgrowth", scope: !20, file: !19, line: 201, baseType: !6, size: 64, offset: 1024)
!47 = !DIDerivedType(tag: DW_TAG_member, name: "work", scope: !20, file: !19, line: 202, baseType: !6, size: 64, offset: 1088)
!48 = !DIDerivedType(tag: DW_TAG_member, name: "memusage", scope: !20, file: !19, line: 204, baseType: !49, size: 64, offset: 1152)
!49 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !50, line: 62, baseType: !51)
!50 = !DIFile(filename: "/Applications/Xcode.app/Contents/Developer/Toolchains/XcodeDefault.xctoolchain/usr/lib/clang/10.0.0/include/stddef.h", directory: "/Users/fak/Dropbox/Projects/SparsePerf/SparseSuite/SparseSuite")
!51 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!52 = !DIDerivedType(tag: DW_TAG_member, name: "mempeak", scope: !20, file: !19, line: 205, baseType: !49, size: 64, offset: 1216)
!53 = !{!54, !55, !56, !57, !58, !59, !60, !61, !62, !63, !64, !65, !66, !67, !68}
!54 = !DILocalVariable(name: "scale", arg: 1, scope: !14, file: !1, line: 22, type: !8)
!55 = !DILocalVariable(name: "n", arg: 2, scope: !14, file: !1, line: 23, type: !8)
!56 = !DILocalVariable(name: "Ap", arg: 3, scope: !14, file: !1, line: 24, type: !7)
!57 = !DILocalVariable(name: "Ai", arg: 4, scope: !14, file: !1, line: 25, type: !7)
!58 = !DILocalVariable(name: "Ax", arg: 5, scope: !14, file: !1, line: 26, type: !5)
!59 = !DILocalVariable(name: "Rs", arg: 6, scope: !14, file: !1, line: 28, type: !5)
!60 = !DILocalVariable(name: "W", arg: 7, scope: !14, file: !1, line: 30, type: !7)
!61 = !DILocalVariable(name: "Common", arg: 8, scope: !14, file: !1, line: 32, type: !17)
!62 = !DILocalVariable(name: "a", scope: !14, file: !1, line: 35, type: !6)
!63 = !DILocalVariable(name: "Az", scope: !14, file: !1, line: 36, type: !5)
!64 = !DILocalVariable(name: "row", scope: !14, file: !1, line: 37, type: !8)
!65 = !DILocalVariable(name: "col", scope: !14, file: !1, line: 37, type: !8)
!66 = !DILocalVariable(name: "p", scope: !14, file: !1, line: 37, type: !8)
!67 = !DILocalVariable(name: "pend", scope: !14, file: !1, line: 37, type: !8)
!68 = !DILocalVariable(name: "check_duplicates", scope: !14, file: !1, line: 37, type: !8)
!69 = !DILocation(line: 22, column: 9, scope: !14)
!70 = !DILocation(line: 23, column: 9, scope: !14)
!71 = !DILocation(line: 24, column: 9, scope: !14)
!72 = !DILocation(line: 25, column: 9, scope: !14)
!73 = !DILocation(line: 26, column: 12, scope: !14)
!74 = !DILocation(line: 28, column: 12, scope: !14)
!75 = !DILocation(line: 30, column: 9, scope: !14)
!76 = !DILocation(line: 32, column: 17, scope: !14)
!77 = !DILocation(line: 43, column: 16, scope: !78)
!78 = distinct !DILexicalBlock(scope: !14, file: !1, line: 43, column: 9)
!79 = !DILocation(line: 43, column: 9, scope: !14)
!80 = !DILocation(line: 47, column: 13, scope: !14)
!81 = !DILocation(line: 47, column: 20, scope: !14)
!82 = !{!83, !87, i64 76}
!83 = !{!"klu_common_struct", !84, i64 0, !84, i64 8, !84, i64 16, !84, i64 24, !84, i64 32, !87, i64 40, !87, i64 44, !87, i64 48, !88, i64 56, !88, i64 64, !87, i64 72, !87, i64 76, !87, i64 80, !87, i64 84, !87, i64 88, !87, i64 92, !87, i64 96, !84, i64 104, !84, i64 112, !84, i64 120, !84, i64 128, !84, i64 136, !89, i64 144, !89, i64 152}
!84 = !{!"double", !85, i64 0}
!85 = !{!"omnipotent char", !86, i64 0}
!86 = !{!"Simple C/C++ TBAA"}
!87 = !{!"int", !85, i64 0}
!88 = !{!"any pointer", !85, i64 0}
!89 = !{!"long", !85, i64 0}
!90 = !DILocation(line: 49, column: 15, scope: !91)
!91 = distinct !DILexicalBlock(scope: !14, file: !1, line: 49, column: 9)
!92 = !DILocation(line: 49, column: 9, scope: !14)
!93 = !DILocation(line: 36, column: 12, scope: !14)
!94 = !DILocation(line: 58, column: 11, scope: !95)
!95 = distinct !DILexicalBlock(scope: !14, file: !1, line: 58, column: 9)
!96 = !DILocation(line: 58, column: 22, scope: !95)
!97 = !DILocation(line: 58, column: 16, scope: !95)
!98 = !DILocation(line: 58, column: 36, scope: !95)
!99 = !DILocation(line: 58, column: 50, scope: !95)
!100 = !DILocation(line: 59, column: 16, scope: !95)
!101 = !DILocation(line: 59, column: 26, scope: !95)
!102 = !DILocation(line: 59, column: 20, scope: !95)
!103 = !DILocation(line: 62, column: 24, scope: !104)
!104 = distinct !DILexicalBlock(scope: !95, file: !1, line: 60, column: 5)
!105 = !DILocation(line: 63, column: 9, scope: !104)
!106 = !DILocation(line: 65, column: 9, scope: !107)
!107 = distinct !DILexicalBlock(scope: !14, file: !1, line: 65, column: 9)
!108 = !{!87, !87, i64 0}
!109 = !DILocation(line: 65, column: 16, scope: !107)
!110 = !DILocation(line: 65, column: 21, scope: !107)
!111 = !DILocation(line: 65, column: 24, scope: !107)
!112 = !DILocation(line: 65, column: 31, scope: !107)
