; ModuleID = 'klu_factor.c'
source_filename = "klu_factor.c"
target datalayout = "e-m:o-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-apple-macosx10.14.0"

%struct.klu_numeric = type { i32, i32, i32, i32, i32, i32, i32*, i32*, i32*, i32*, i32*, i32*, i8**, i64*, i8*, double*, i64, i8*, i8*, i32*, i32*, i32*, i8*, i32 }
%struct.klu_symbolic = type { double, double, double, double, double*, i32, i32, i32*, i32*, i32*, i32, i32, i32, i32, i32, i32 }
%struct.klu_common_struct = type { double, double, double, double, double, i32, i32, i32, i32 (i32, i32*, i32*, i32*, %struct.klu_common_struct*)*, i8*, i32, i32, i32, i32, i32, i32, i32, double, double, double, double, double, i64, i64 }

; Function Attrs: nounwind ssp uwtable
define %struct.klu_numeric* @klu_factor(i32*, i32*, double*, %struct.klu_symbolic* readonly, %struct.klu_common_struct*) local_unnamed_addr #0 !dbg !21 {
  %6 = alloca i32, align 4
  %7 = alloca %struct.klu_numeric*, align 8
  call void @llvm.dbg.value(metadata i32* %0, metadata !108, metadata !DIExpression()), !dbg !125
  call void @llvm.dbg.value(metadata i32* %1, metadata !109, metadata !DIExpression()), !dbg !126
  call void @llvm.dbg.value(metadata double* %2, metadata !110, metadata !DIExpression()), !dbg !127
  call void @llvm.dbg.value(metadata %struct.klu_symbolic* %3, metadata !111, metadata !DIExpression()), !dbg !128
  call void @llvm.dbg.value(metadata %struct.klu_common_struct* %4, metadata !112, metadata !DIExpression()), !dbg !129

!0 = distinct !DICompileUnit(language: DW_LANG_C99, file: !1, producer: "Apple LLVM version 10.0.0 (clang-1000.11.45.5)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !2, retainedTypes: !3)
!1 = !DIFile(filename: "klu_factor.c", directory: "/Users/fak/Dropbox/Projects/SparsePerf/SparseSuite/SparseSuite")
!2 = !{}
!3 = !{!4, !5, !8, !10, !12}
!4 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!5 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !6, line: 62, baseType: !7)
!6 = !DIFile(filename: "/Applications/Xcode.app/Contents/Developer/Toolchains/XcodeDefault.xctoolchain/usr/lib/clang/10.0.0/include/stddef.h", directory: "/Users/fak/Dropbox/Projects/SparsePerf/SparseSuite/SparseSuite")
!7 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!8 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !9, size: 64)
!9 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!10 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !11, size: 64)
!11 = !DIBasicType(name: "double", size: 64, encoding: DW_ATE_float)
!12 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !13, size: 64)
!13 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !14, size: 64)
!14 = !DIDerivedType(tag: DW_TAG_typedef, name: "Unit", file: !15, line: 253, baseType: !11)
!15 = !DIFile(filename: "./klu_version.h", directory: "/Users/fak/Dropbox/Projects/SparsePerf/SparseSuite/SparseSuite")
!16 = !{i32 2, !"Dwarf Version", i32 4}
!17 = !{i32 2, !"Debug Info Version", i32 3}
!18 = !{i32 1, !"wchar_size", i32 4}
!19 = !{i32 7, !"PIC Level", i32 2}
!20 = !{!"Apple LLVM version 10.0.0 (clang-1000.11.45.5)"}
!21 = distinct !DISubprogram(name: "klu_factor", scope: !1, file: !1, line: 384, type: !22, isLocal: false, isDefinition: true, scopeLine: 395, flags: DIFlagPrototyped, isOptimized: true, unit: !0, variables: !107)
!22 = !DISubroutineType(types: !23)
!23 = !{!24, !8, !8, !10, !55, !75}
!24 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !25, size: 64)
!25 = !DIDerivedType(tag: DW_TAG_typedef, name: "klu_numeric", file: !26, line: 107, baseType: !27)
!26 = !DIFile(filename: "./klu.h", directory: "/Users/fak/Dropbox/Projects/SparsePerf/SparseSuite/SparseSuite")
!27 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !26, line: 69, size: 1344, elements: !28)
!28 = !{!29, !30, !31, !32, !33, !34, !35, !36, !37, !38, !39, !40, !41, !43, !45, !46, !47, !48, !49, !50, !51, !52, !53, !54}
!29 = !DIDerivedType(tag: DW_TAG_member, name: "n", scope: !27, file: !26, line: 74, baseType: !9, size: 32)
!30 = !DIDerivedType(tag: DW_TAG_member, name: "nblocks", scope: !27, file: !26, line: 75, baseType: !9, size: 32, offset: 32)
!31 = !DIDerivedType(tag: DW_TAG_member, name: "lnz", scope: !27, file: !26, line: 76, baseType: !9, size: 32, offset: 64)
!32 = !DIDerivedType(tag: DW_TAG_member, name: "unz", scope: !27, file: !26, line: 77, baseType: !9, size: 32, offset: 96)
!33 = !DIDerivedType(tag: DW_TAG_member, name: "max_lnz_block", scope: !27, file: !26, line: 78, baseType: !9, size: 32, offset: 128)
!34 = !DIDerivedType(tag: DW_TAG_member, name: "max_unz_block", scope: !27, file: !26, line: 79, baseType: !9, size: 32, offset: 160)
!35 = !DIDerivedType(tag: DW_TAG_member, name: "Pnum", scope: !27, file: !26, line: 80, baseType: !8, size: 64, offset: 192)
!36 = !DIDerivedType(tag: DW_TAG_member, name: "Pinv", scope: !27, file: !26, line: 81, baseType: !8, size: 64, offset: 256)
!37 = !DIDerivedType(tag: DW_TAG_member, name: "Lip", scope: !27, file: !26, line: 84, baseType: !8, size: 64, offset: 320)
!38 = !DIDerivedType(tag: DW_TAG_member, name: "Uip", scope: !27, file: !26, line: 85, baseType: !8, size: 64, offset: 384)
!39 = !DIDerivedType(tag: DW_TAG_member, name: "Llen", scope: !27, file: !26, line: 86, baseType: !8, size: 64, offset: 448)
!40 = !DIDerivedType(tag: DW_TAG_member, name: "Ulen", scope: !27, file: !26, line: 87, baseType: !8, size: 64, offset: 512)
!41 = !DIDerivedType(tag: DW_TAG_member, name: "LUbx", scope: !27, file: !26, line: 88, baseType: !42, size: 64, offset: 576)
!42 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !4, size: 64)
!43 = !DIDerivedType(tag: DW_TAG_member, name: "LUsize", scope: !27, file: !26, line: 89, baseType: !44, size: 64, offset: 640)
!44 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !5, size: 64)
!45 = !DIDerivedType(tag: DW_TAG_member, name: "Udiag", scope: !27, file: !26, line: 90, baseType: !4, size: 64, offset: 704)
!46 = !DIDerivedType(tag: DW_TAG_member, name: "Rs", scope: !27, file: !26, line: 93, baseType: !10, size: 64, offset: 768)
!47 = !DIDerivedType(tag: DW_TAG_member, name: "worksize", scope: !27, file: !26, line: 96, baseType: !5, size: 64, offset: 832)
!48 = !DIDerivedType(tag: DW_TAG_member, name: "Work", scope: !27, file: !26, line: 97, baseType: !4, size: 64, offset: 896)
!49 = !DIDerivedType(tag: DW_TAG_member, name: "Xwork", scope: !27, file: !26, line: 98, baseType: !4, size: 64, offset: 960)
!50 = !DIDerivedType(tag: DW_TAG_member, name: "Iwork", scope: !27, file: !26, line: 99, baseType: !8, size: 64, offset: 1024)
!51 = !DIDerivedType(tag: DW_TAG_member, name: "Offp", scope: !27, file: !26, line: 102, baseType: !8, size: 64, offset: 1088)
!52 = !DIDerivedType(tag: DW_TAG_member, name: "Offi", scope: !27, file: !26, line: 103, baseType: !8, size: 64, offset: 1152)
!53 = !DIDerivedType(tag: DW_TAG_member, name: "Offx", scope: !27, file: !26, line: 104, baseType: !4, size: 64, offset: 1216)
!54 = !DIDerivedType(tag: DW_TAG_member, name: "nzoff", scope: !27, file: !26, line: 105, baseType: !9, size: 32, offset: 1280)
!55 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !56, size: 64)
!56 = !DIDerivedType(tag: DW_TAG_typedef, name: "klu_symbolic", file: !26, line: 54, baseType: !57)
!57 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !26, line: 23, size: 768, elements: !58)
!58 = !{!59, !60, !61, !62, !63, !64, !65, !66, !67, !68, !69, !70, !71, !72, !73, !74}
!59 = !DIDerivedType(tag: DW_TAG_member, name: "symmetry", scope: !57, file: !26, line: 31, baseType: !11, size: 64)
!60 = !DIDerivedType(tag: DW_TAG_member, name: "est_flops", scope: !57, file: !26, line: 32, baseType: !11, size: 64, offset: 64)
!61 = !DIDerivedType(tag: DW_TAG_member, name: "lnz", scope: !57, file: !26, line: 33, baseType: !11, size: 64, offset: 128)
!62 = !DIDerivedType(tag: DW_TAG_member, name: "unz", scope: !57, file: !26, line: 33, baseType: !11, size: 64, offset: 192)
!63 = !DIDerivedType(tag: DW_TAG_member, name: "Lnz", scope: !57, file: !26, line: 34, baseType: !10, size: 64, offset: 256)
!64 = !DIDerivedType(tag: DW_TAG_member, name: "n", scope: !57, file: !26, line: 38, baseType: !9, size: 32, offset: 320)
!65 = !DIDerivedType(tag: DW_TAG_member, name: "nz", scope: !57, file: !26, line: 39, baseType: !9, size: 32, offset: 352)
!66 = !DIDerivedType(tag: DW_TAG_member, name: "P", scope: !57, file: !26, line: 40, baseType: !8, size: 64, offset: 384)
!67 = !DIDerivedType(tag: DW_TAG_member, name: "Q", scope: !57, file: !26, line: 41, baseType: !8, size: 64, offset: 448)
!68 = !DIDerivedType(tag: DW_TAG_member, name: "R", scope: !57, file: !26, line: 42, baseType: !8, size: 64, offset: 512)
!69 = !DIDerivedType(tag: DW_TAG_member, name: "nzoff", scope: !57, file: !26, line: 43, baseType: !9, size: 32, offset: 576)
!70 = !DIDerivedType(tag: DW_TAG_member, name: "nblocks", scope: !57, file: !26, line: 44, baseType: !9, size: 32, offset: 608)
!71 = !DIDerivedType(tag: DW_TAG_member, name: "maxblock", scope: !57, file: !26, line: 45, baseType: !9, size: 32, offset: 640)
!72 = !DIDerivedType(tag: DW_TAG_member, name: "ordering", scope: !57, file: !26, line: 46, baseType: !9, size: 32, offset: 672)
!73 = !DIDerivedType(tag: DW_TAG_member, name: "do_btf", scope: !57, file: !26, line: 47, baseType: !9, size: 32, offset: 704)
!74 = !DIDerivedType(tag: DW_TAG_member, name: "structural_rank", scope: !57, file: !26, line: 50, baseType: !9, size: 32, offset: 736)
!75 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !76, size: 64)
!76 = !DIDerivedType(tag: DW_TAG_typedef, name: "klu_common", file: !26, line: 207, baseType: !77)
!77 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "klu_common_struct", file: !26, line: 137, size: 1280, elements: !78)
!78 = !{!79, !80, !81, !82, !83, !84, !85, !86, !87, !92, !93, !94, !95, !96, !97, !98, !99, !100, !101, !102, !103, !104, !105, !106}
!79 = !DIDerivedType(tag: DW_TAG_member, name: "tol", scope: !77, file: !26, line: 144, baseType: !11, size: 64)
!80 = !DIDerivedType(tag: DW_TAG_member, name: "memgrow", scope: !77, file: !26, line: 145, baseType: !11, size: 64, offset: 64)
!81 = !DIDerivedType(tag: DW_TAG_member, name: "initmem_amd", scope: !77, file: !26, line: 146, baseType: !11, size: 64, offset: 128)
!82 = !DIDerivedType(tag: DW_TAG_member, name: "initmem", scope: !77, file: !26, line: 147, baseType: !11, size: 64, offset: 192)
!83 = !DIDerivedType(tag: DW_TAG_member, name: "maxwork", scope: !77, file: !26, line: 148, baseType: !11, size: 64, offset: 256)
!84 = !DIDerivedType(tag: DW_TAG_member, name: "btf", scope: !77, file: !26, line: 150, baseType: !9, size: 32, offset: 320)
!85 = !DIDerivedType(tag: DW_TAG_member, name: "ordering", scope: !77, file: !26, line: 151, baseType: !9, size: 32, offset: 352)
!86 = !DIDerivedType(tag: DW_TAG_member, name: "scale", scope: !77, file: !26, line: 153, baseType: !9, size: 32, offset: 384)
!87 = !DIDerivedType(tag: DW_TAG_member, name: "user_order", scope: !77, file: !26, line: 157, baseType: !88, size: 64, offset: 448)
!88 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !89, size: 64)
!89 = !DISubroutineType(types: !90)
!90 = !{!9, !9, !8, !8, !8, !91}
!91 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !77, size: 64)
!92 = !DIDerivedType(tag: DW_TAG_member, name: "user_data", scope: !77, file: !26, line: 162, baseType: !4, size: 64, offset: 512)
!93 = !DIDerivedType(tag: DW_TAG_member, name: "halt_if_singular", scope: !77, file: !26, line: 164, baseType: !9, size: 32, offset: 576)
!94 = !DIDerivedType(tag: DW_TAG_member, name: "status", scope: !77, file: !26, line: 177, baseType: !9, size: 32, offset: 608)
!95 = !DIDerivedType(tag: DW_TAG_member, name: "nrealloc", scope: !77, file: !26, line: 178, baseType: !9, size: 32, offset: 640)
!96 = !DIDerivedType(tag: DW_TAG_member, name: "structural_rank", scope: !77, file: !26, line: 180, baseType: !9, size: 32, offset: 672)
!97 = !DIDerivedType(tag: DW_TAG_member, name: "numerical_rank", scope: !77, file: !26, line: 185, baseType: !9, size: 32, offset: 704)
!98 = !DIDerivedType(tag: DW_TAG_member, name: "singular_col", scope: !77, file: !26, line: 191, baseType: !9, size: 32, offset: 736)
!99 = !DIDerivedType(tag: DW_TAG_member, name: "noffdiag", scope: !77, file: !26, line: 196, baseType: !9, size: 32, offset: 768)
!100 = !DIDerivedType(tag: DW_TAG_member, name: "flops", scope: !77, file: !26, line: 198, baseType: !11, size: 64, offset: 832)
!101 = !DIDerivedType(tag: DW_TAG_member, name: "rcond", scope: !77, file: !26, line: 199, baseType: !11, size: 64, offset: 896)
!102 = !DIDerivedType(tag: DW_TAG_member, name: "condest", scope: !77, file: !26, line: 200, baseType: !11, size: 64, offset: 960)
!103 = !DIDerivedType(tag: DW_TAG_member, name: "rgrowth", scope: !77, file: !26, line: 201, baseType: !11, size: 64, offset: 1024)
!104 = !DIDerivedType(tag: DW_TAG_member, name: "work", scope: !77, file: !26, line: 202, baseType: !11, size: 64, offset: 1088)
!105 = !DIDerivedType(tag: DW_TAG_member, name: "memusage", scope: !77, file: !26, line: 204, baseType: !5, size: 64, offset: 1152)
!106 = !DIDerivedType(tag: DW_TAG_member, name: "mempeak", scope: !77, file: !26, line: 205, baseType: !5, size: 64, offset: 1216)
!107 = !{!108, !109, !110, !111, !112, !113, !114, !115, !116, !117, !118, !119, !120, !121, !122, !123, !124}
!108 = !DILocalVariable(name: "Ap", arg: 1, scope: !21, file: !1, line: 388, type: !8)
!109 = !DILocalVariable(name: "Ai", arg: 2, scope: !21, file: !1, line: 389, type: !8)
!110 = !DILocalVariable(name: "Ax", arg: 3, scope: !21, file: !1, line: 390, type: !10)
!111 = !DILocalVariable(name: "Symbolic", arg: 4, scope: !21, file: !1, line: 391, type: !55)
!112 = !DILocalVariable(name: "Common", arg: 5, scope: !21, file: !1, line: 393, type: !75)
!113 = !DILocalVariable(name: "n", scope: !21, file: !1, line: 396, type: !9)
!114 = !DILocalVariable(name: "nzoff", scope: !21, file: !1, line: 396, type: !9)
!115 = !DILocalVariable(name: "nblocks", scope: !21, file: !1, line: 396, type: !9)
!116 = !DILocalVariable(name: "maxblock", scope: !21, file: !1, line: 396, type: !9)
!117 = !DILocalVariable(name: "k", scope: !21, file: !1, line: 396, type: !9)
!118 = !DILocalVariable(name: "ok", scope: !21, file: !1, line: 396, type: !9)
!119 = !DILocalVariable(name: "Numeric", scope: !21, file: !1, line: 397, type: !24)
!120 = !DILocalVariable(name: "n1", scope: !21, file: !1, line: 398, type: !5)
!121 = !DILocalVariable(name: "nzoff1", scope: !21, file: !1, line: 398, type: !5)
!122 = !DILocalVariable(name: "s", scope: !21, file: !1, line: 398, type: !5)
!123 = !DILocalVariable(name: "b6", scope: !21, file: !1, line: 398, type: !5)
!124 = !DILocalVariable(name: "n3", scope: !21, file: !1, line: 398, type: !5)
!125 = !DILocation(line: 388, column: 9, scope: !21)
!126 = !DILocation(line: 389, column: 9, scope: !21)
!127 = !DILocation(line: 390, column: 12, scope: !21)
!128 = !DILocation(line: 391, column: 19, scope: !21)
!129 = !DILocation(line: 393, column: 17, scope: !21)
!130 = !DILocation(line: 396, column: 5, scope: !21)
!131 = !DILocation(line: 396, column: 41, scope: !21)
!132 = !{!133, !133, i64 0}
!133 = !{!"int", !134, i64 0}
!134 = !{!"omnipotent char", !135, i64 0}
!135 = !{!"Simple C/C++ TBAA"}
!136 = !DILocation(line: 397, column: 5, scope: !21)
!137 = !DILocation(line: 400, column: 16, scope: !138)
!138 = distinct !DILexicalBlock(scope: !21, file: !1, line: 400, column: 9)
!139 = !DILocation(line: 400, column: 9, scope: !21)
!140 = !DILocation(line: 404, column: 13, scope: !21)
!141 = !DILocation(line: 404, column: 20, scope: !21)
!142 = !{!143, !133, i64 76}
!143 = !{!"klu_common_struct", !144, i64 0, !144, i64 8, !144, i64 16, !144, i64 24, !144, i64 32, !133, i64 40, !133, i64 44, !133, i64 48, !145, i64 56, !145, i64 64, !133, i64 72, !133, i64 76, !133, i64 80, !133, i64 84, !133, i64 88, !133, i64 92, !133, i64 96, !144, i64 104, !144, i64 112, !144, i64 120, !144, i64 128, !144, i64 136, !146, i64 144, !146, i64 152}
!144 = !{!"double", !134, i64 0}
!145 = !{!"any pointer", !134, i64 0}
!146 = !{!"long", !134, i64 0}
!147 = !DILocation(line: 405, column: 13, scope: !21)
!148 = !DILocation(line: 405, column: 28, scope: !21)
!149 = !{!143, !133, i64 88}
!150 = !DILocation(line: 406, column: 13, scope: !21)
!151 = !DILocation(line: 406, column: 26, scope: !21)
!152 = !{!143, !133, i64 92}
!153 = !DILocation(line: 413, column: 18, scope: !154)
!154 = distinct !DILexicalBlock(scope: !21, file: !1, line: 413, column: 9)
!155 = !DILocation(line: 413, column: 9, scope: !21)
!156 = !DILocation(line: 415, column: 24, scope: !157)
!157 = distinct !DILexicalBlock(scope: !154, file: !1, line: 414, column: 5)
!158 = !DILocation(line: 416, column: 9, scope: !157)
!159 = !DILocation(line: 419, column: 19, scope: !21)
!160 = !{!161, !133, i64 40}
!161 = !{!"", !144, i64 0, !144, i64 8, !144, i64 16, !144, i64 24, !145, i64 32, !133, i64 40, !133, i64 44, !145, i64 48, !145, i64 56, !145, i64 64, !133, i64 72, !133, i64 76, !133, i64 80, !133, i64 84, !133, i64 88, !133, i64 92}
