; ModuleID = 'klu_refactor.c'
source_filename = "klu_refactor.c"
target datalayout = "e-m:o-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-apple-macosx10.14.0"

%struct.klu_symbolic = type { double, double, double, double, double*, i32, i32, i32*, i32*, i32*, i32, i32, i32, i32, i32, i32 }
%struct.klu_numeric = type { i32, i32, i32, i32, i32, i32, i32*, i32*, i32*, i32*, i32*, i32*, i8**, i64*, i8*, double*, i64, i8*, i8*, i32*, i32*, i32*, i8*, i32 }
%struct.klu_common_struct = type { double, double, double, double, double, i32, i32, i32, i32 (i32, i32*, i32*, i32*, %struct.klu_common_struct*)*, i8*, i32, i32, i32, i32, i32, i32, i32, double, double, double, double, double, i64, i64 }

; Function Attrs: nounwind ssp uwtable
define i32 @klu_refactor(i32*, i32*, double*, %struct.klu_symbolic* nocapture readonly, %struct.klu_numeric*, %struct.klu_common_struct*) local_unnamed_addr #0 !dbg !18 {
  call void @llvm.dbg.value(metadata i32* %0, metadata !108, metadata !DIExpression()), !dbg !194
  call void @llvm.dbg.value(metadata i32* %1, metadata !109, metadata !DIExpression()), !dbg !195
  call void @llvm.dbg.value(metadata double* %2, metadata !110, metadata !DIExpression()), !dbg !196
  call void @llvm.dbg.value(metadata %struct.klu_symbolic* %3, metadata !111, metadata !DIExpression()), !dbg !197
  call void @llvm.dbg.value(metadata %struct.klu_numeric* %4, metadata !112, metadata !DIExpression()), !dbg !198

!0 = distinct !DICompileUnit(language: DW_LANG_C99, file: !1, producer: "Apple LLVM version 10.0.0 (clang-1000.11.45.5)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !2, retainedTypes: !3)
!1 = !DIFile(filename: "klu_refactor.c", directory: "/Users/fak/Dropbox/Projects/SparsePerf/SparseSuite/SparseSuite")
!2 = !{}
!3 = !{!4, !5, !7, !11}
!4 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!5 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !6, size: 64)
!6 = !DIBasicType(name: "double", size: 64, encoding: DW_ATE_float)
!7 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !8, size: 64)
!8 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !9, size: 64)
!9 = !DIDerivedType(tag: DW_TAG_typedef, name: "Unit", file: !10, line: 253, baseType: !6)
!10 = !DIFile(filename: "./klu_version.h", directory: "/Users/fak/Dropbox/Projects/SparsePerf/SparseSuite/SparseSuite")
!11 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !12, size: 64)
!12 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!13 = !{i32 2, !"Dwarf Version", i32 4}
!14 = !{i32 2, !"Debug Info Version", i32 3}
!15 = !{i32 1, !"wchar_size", i32 4}
!16 = !{i32 7, !"PIC Level", i32 2}
!17 = !{!"Apple LLVM version 10.0.0 (clang-1000.11.45.5)"}
!18 = distinct !DISubprogram(name: "klu_refactor", scope: !1, file: !1, line: 18, type: !19, isLocal: false, isDefinition: true, scopeLine: 30, flags: DIFlagPrototyped, isOptimized: true, unit: !0, variables: !107)
!19 = !DISubroutineType(types: !20)
!20 = !{!12, !11, !11, !5, !21, !42, !75}
!21 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !22, size: 64)
!22 = !DIDerivedType(tag: DW_TAG_typedef, name: "klu_symbolic", file: !23, line: 54, baseType: !24)
!23 = !DIFile(filename: "./klu.h", directory: "/Users/fak/Dropbox/Projects/SparsePerf/SparseSuite/SparseSuite")
!24 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !23, line: 23, size: 768, elements: !25)
!25 = !{!26, !27, !28, !29, !30, !31, !32, !33, !34, !35, !36, !37, !38, !39, !40, !41}
!26 = !DIDerivedType(tag: DW_TAG_member, name: "symmetry", scope: !24, file: !23, line: 31, baseType: !6, size: 64)
!27 = !DIDerivedType(tag: DW_TAG_member, name: "est_flops", scope: !24, file: !23, line: 32, baseType: !6, size: 64, offset: 64)
!28 = !DIDerivedType(tag: DW_TAG_member, name: "lnz", scope: !24, file: !23, line: 33, baseType: !6, size: 64, offset: 128)
!29 = !DIDerivedType(tag: DW_TAG_member, name: "unz", scope: !24, file: !23, line: 33, baseType: !6, size: 64, offset: 192)
!30 = !DIDerivedType(tag: DW_TAG_member, name: "Lnz", scope: !24, file: !23, line: 34, baseType: !5, size: 64, offset: 256)
!31 = !DIDerivedType(tag: DW_TAG_member, name: "n", scope: !24, file: !23, line: 38, baseType: !12, size: 32, offset: 320)
!32 = !DIDerivedType(tag: DW_TAG_member, name: "nz", scope: !24, file: !23, line: 39, baseType: !12, size: 32, offset: 352)
!33 = !DIDerivedType(tag: DW_TAG_member, name: "P", scope: !24, file: !23, line: 40, baseType: !11, size: 64, offset: 384)
!34 = !DIDerivedType(tag: DW_TAG_member, name: "Q", scope: !24, file: !23, line: 41, baseType: !11, size: 64, offset: 448)
!35 = !DIDerivedType(tag: DW_TAG_member, name: "R", scope: !24, file: !23, line: 42, baseType: !11, size: 64, offset: 512)
!36 = !DIDerivedType(tag: DW_TAG_member, name: "nzoff", scope: !24, file: !23, line: 43, baseType: !12, size: 32, offset: 576)
!37 = !DIDerivedType(tag: DW_TAG_member, name: "nblocks", scope: !24, file: !23, line: 44, baseType: !12, size: 32, offset: 608)
!38 = !DIDerivedType(tag: DW_TAG_member, name: "maxblock", scope: !24, file: !23, line: 45, baseType: !12, size: 32, offset: 640)
!39 = !DIDerivedType(tag: DW_TAG_member, name: "ordering", scope: !24, file: !23, line: 46, baseType: !12, size: 32, offset: 672)
!40 = !DIDerivedType(tag: DW_TAG_member, name: "do_btf", scope: !24, file: !23, line: 47, baseType: !12, size: 32, offset: 704)
!41 = !DIDerivedType(tag: DW_TAG_member, name: "structural_rank", scope: !24, file: !23, line: 50, baseType: !12, size: 32, offset: 736)
!42 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !43, size: 64)
!43 = !DIDerivedType(tag: DW_TAG_typedef, name: "klu_numeric", file: !23, line: 107, baseType: !44)
!44 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !23, line: 69, size: 1344, elements: !45)
!45 = !{!46, !47, !48, !49, !50, !51, !52, !53, !54, !55, !56, !57, !58, !60, !65, !66, !67, !68, !69, !70, !71, !72, !73, !74}
!46 = !DIDerivedType(tag: DW_TAG_member, name: "n", scope: !44, file: !23, line: 74, baseType: !12, size: 32)
!47 = !DIDerivedType(tag: DW_TAG_member, name: "nblocks", scope: !44, file: !23, line: 75, baseType: !12, size: 32, offset: 32)
!48 = !DIDerivedType(tag: DW_TAG_member, name: "lnz", scope: !44, file: !23, line: 76, baseType: !12, size: 32, offset: 64)
!49 = !DIDerivedType(tag: DW_TAG_member, name: "unz", scope: !44, file: !23, line: 77, baseType: !12, size: 32, offset: 96)
!50 = !DIDerivedType(tag: DW_TAG_member, name: "max_lnz_block", scope: !44, file: !23, line: 78, baseType: !12, size: 32, offset: 128)
!51 = !DIDerivedType(tag: DW_TAG_member, name: "max_unz_block", scope: !44, file: !23, line: 79, baseType: !12, size: 32, offset: 160)
!52 = !DIDerivedType(tag: DW_TAG_member, name: "Pnum", scope: !44, file: !23, line: 80, baseType: !11, size: 64, offset: 192)
!53 = !DIDerivedType(tag: DW_TAG_member, name: "Pinv", scope: !44, file: !23, line: 81, baseType: !11, size: 64, offset: 256)
!54 = !DIDerivedType(tag: DW_TAG_member, name: "Lip", scope: !44, file: !23, line: 84, baseType: !11, size: 64, offset: 320)
!55 = !DIDerivedType(tag: DW_TAG_member, name: "Uip", scope: !44, file: !23, line: 85, baseType: !11, size: 64, offset: 384)
!56 = !DIDerivedType(tag: DW_TAG_member, name: "Llen", scope: !44, file: !23, line: 86, baseType: !11, size: 64, offset: 448)
!57 = !DIDerivedType(tag: DW_TAG_member, name: "Ulen", scope: !44, file: !23, line: 87, baseType: !11, size: 64, offset: 512)
!58 = !DIDerivedType(tag: DW_TAG_member, name: "LUbx", scope: !44, file: !23, line: 88, baseType: !59, size: 64, offset: 576)
!59 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !4, size: 64)
!60 = !DIDerivedType(tag: DW_TAG_member, name: "LUsize", scope: !44, file: !23, line: 89, baseType: !61, size: 64, offset: 640)
!61 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !62, size: 64)
!62 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !63, line: 62, baseType: !64)
!63 = !DIFile(filename: "/Applications/Xcode.app/Contents/Developer/Toolchains/XcodeDefault.xctoolchain/usr/lib/clang/10.0.0/include/stddef.h", directory: "/Users/fak/Dropbox/Projects/SparsePerf/SparseSuite/SparseSuite")
!64 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!65 = !DIDerivedType(tag: DW_TAG_member, name: "Udiag", scope: !44, file: !23, line: 90, baseType: !4, size: 64, offset: 704)
!66 = !DIDerivedType(tag: DW_TAG_member, name: "Rs", scope: !44, file: !23, line: 93, baseType: !5, size: 64, offset: 768)
!67 = !DIDerivedType(tag: DW_TAG_member, name: "worksize", scope: !44, file: !23, line: 96, baseType: !62, size: 64, offset: 832)
!68 = !DIDerivedType(tag: DW_TAG_member, name: "Work", scope: !44, file: !23, line: 97, baseType: !4, size: 64, offset: 896)
!69 = !DIDerivedType(tag: DW_TAG_member, name: "Xwork", scope: !44, file: !23, line: 98, baseType: !4, size: 64, offset: 960)
!70 = !DIDerivedType(tag: DW_TAG_member, name: "Iwork", scope: !44, file: !23, line: 99, baseType: !11, size: 64, offset: 1024)
!71 = !DIDerivedType(tag: DW_TAG_member, name: "Offp", scope: !44, file: !23, line: 102, baseType: !11, size: 64, offset: 1088)
!72 = !DIDerivedType(tag: DW_TAG_member, name: "Offi", scope: !44, file: !23, line: 103, baseType: !11, size: 64, offset: 1152)
!73 = !DIDerivedType(tag: DW_TAG_member, name: "Offx", scope: !44, file: !23, line: 104, baseType: !4, size: 64, offset: 1216)
!74 = !DIDerivedType(tag: DW_TAG_member, name: "nzoff", scope: !44, file: !23, line: 105, baseType: !12, size: 32, offset: 1280)
!75 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !76, size: 64)
!76 = !DIDerivedType(tag: DW_TAG_typedef, name: "klu_common", file: !23, line: 207, baseType: !77)
!77 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "klu_common_struct", file: !23, line: 137, size: 1280, elements: !78)
!78 = !{!79, !80, !81, !82, !83, !84, !85, !86, !87, !92, !93, !94, !95, !96, !97, !98, !99, !100, !101, !102, !103, !104, !105, !106}
!79 = !DIDerivedType(tag: DW_TAG_member, name: "tol", scope: !77, file: !23, line: 144, baseType: !6, size: 64)
!80 = !DIDerivedType(tag: DW_TAG_member, name: "memgrow", scope: !77, file: !23, line: 145, baseType: !6, size: 64, offset: 64)
!81 = !DIDerivedType(tag: DW_TAG_member, name: "initmem_amd", scope: !77, file: !23, line: 146, baseType: !6, size: 64, offset: 128)
!82 = !DIDerivedType(tag: DW_TAG_member, name: "initmem", scope: !77, file: !23, line: 147, baseType: !6, size: 64, offset: 192)
!83 = !DIDerivedType(tag: DW_TAG_member, name: "maxwork", scope: !77, file: !23, line: 148, baseType: !6, size: 64, offset: 256)
!84 = !DIDerivedType(tag: DW_TAG_member, name: "btf", scope: !77, file: !23, line: 150, baseType: !12, size: 32, offset: 320)
!85 = !DIDerivedType(tag: DW_TAG_member, name: "ordering", scope: !77, file: !23, line: 151, baseType: !12, size: 32, offset: 352)
!86 = !DIDerivedType(tag: DW_TAG_member, name: "scale", scope: !77, file: !23, line: 153, baseType: !12, size: 32, offset: 384)
!87 = !DIDerivedType(tag: DW_TAG_member, name: "user_order", scope: !77, file: !23, line: 157, baseType: !88, size: 64, offset: 448)
!88 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !89, size: 64)
!89 = !DISubroutineType(types: !90)
!90 = !{!12, !12, !11, !11, !11, !91}
!91 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !77, size: 64)
!92 = !DIDerivedType(tag: DW_TAG_member, name: "user_data", scope: !77, file: !23, line: 162, baseType: !4, size: 64, offset: 512)
!93 = !DIDerivedType(tag: DW_TAG_member, name: "halt_if_singular", scope: !77, file: !23, line: 164, baseType: !12, size: 32, offset: 576)
!94 = !DIDerivedType(tag: DW_TAG_member, name: "status", scope: !77, file: !23, line: 177, baseType: !12, size: 32, offset: 608)
!95 = !DIDerivedType(tag: DW_TAG_member, name: "nrealloc", scope: !77, file: !23, line: 178, baseType: !12, size: 32, offset: 640)
!96 = !DIDerivedType(tag: DW_TAG_member, name: "structural_rank", scope: !77, file: !23, line: 180, baseType: !12, size: 32, offset: 672)
!97 = !DIDerivedType(tag: DW_TAG_member, name: "numerical_rank", scope: !77, file: !23, line: 185, baseType: !12, size: 32, offset: 704)
!98 = !DIDerivedType(tag: DW_TAG_member, name: "singular_col", scope: !77, file: !23, line: 191, baseType: !12, size: 32, offset: 736)
!99 = !DIDerivedType(tag: DW_TAG_member, name: "noffdiag", scope: !77, file: !23, line: 196, baseType: !12, size: 32, offset: 768)
!100 = !DIDerivedType(tag: DW_TAG_member, name: "flops", scope: !77, file: !23, line: 198, baseType: !6, size: 64, offset: 832)
!101 = !DIDerivedType(tag: DW_TAG_member, name: "rcond", scope: !77, file: !23, line: 199, baseType: !6, size: 64, offset: 896)
!102 = !DIDerivedType(tag: DW_TAG_member, name: "condest", scope: !77, file: !23, line: 200, baseType: !6, size: 64, offset: 960)
!103 = !DIDerivedType(tag: DW_TAG_member, name: "rgrowth", scope: !77, file: !23, line: 201, baseType: !6, size: 64, offset: 1024)
!104 = !DIDerivedType(tag: DW_TAG_member, name: "work", scope: !77, file: !23, line: 202, baseType: !6, size: 64, offset: 1088)
!105 = !DIDerivedType(tag: DW_TAG_member, name: "memusage", scope: !77, file: !23, line: 204, baseType: !62, size: 64, offset: 1152)
!106 = !DIDerivedType(tag: DW_TAG_member, name: "mempeak", scope: !77, file: !23, line: 205, baseType: !62, size: 64, offset: 1216)
!107 = !{!108, !109, !110, !111, !112, !113, !114, !115, !116, !117, !118, !119, !120, !121, !122, !123, !124, !125, !126, !127, !128, !129, !130, !131, !132, !133, !134, !135, !136, !137, !138, !139, !140, !141, !142, !143, !144, !145, !146, !147, !148, !149, !150, !151, !152, !153, !154, !155, !156, !157, !169, !174, !176, !187, !192}
!108 = !DILocalVariable(name: "Ap", arg: 1, scope: !18, file: !1, line: 21, type: !11)
!109 = !DILocalVariable(name: "Ai", arg: 2, scope: !18, file: !1, line: 22, type: !11)
!110 = !DILocalVariable(name: "Ax", arg: 3, scope: !18, file: !1, line: 23, type: !5)
!111 = !DILocalVariable(name: "Symbolic", arg: 4, scope: !18, file: !1, line: 24, type: !21)
!112 = !DILocalVariable(name: "Numeric", arg: 5, scope: !18, file: !1, line: 27, type: !42)
!113 = !DILocalVariable(name: "Common", arg: 6, scope: !18, file: !1, line: 28, type: !75)
!114 = !DILocalVariable(name: "ukk", scope: !18, file: !1, line: 31, type: !6)
!115 = !DILocalVariable(name: "ujk", scope: !18, file: !1, line: 31, type: !6)
!116 = !DILocalVariable(name: "s", scope: !18, file: !1, line: 31, type: !6)
!117 = !DILocalVariable(name: "Offx", scope: !18, file: !1, line: 32, type: !5)
!118 = !DILocalVariable(name: "Lx", scope: !18, file: !1, line: 32, type: !5)
!119 = !DILocalVariable(name: "Ux", scope: !18, file: !1, line: 32, type: !5)
!120 = !DILocalVariable(name: "X", scope: !18, file: !1, line: 32, type: !5)
!121 = !DILocalVariable(name: "Az", scope: !18, file: !1, line: 32, type: !5)
!122 = !DILocalVariable(name: "Udiag", scope: !18, file: !1, line: 32, type: !5)
!123 = !DILocalVariable(name: "Rs", scope: !18, file: !1, line: 33, type: !5)
!124 = !DILocalVariable(name: "Q", scope: !18, file: !1, line: 34, type: !11)
!125 = !DILocalVariable(name: "R", scope: !18, file: !1, line: 34, type: !11)
!126 = !DILocalVariable(name: "Pnum", scope: !18, file: !1, line: 34, type: !11)
!127 = !DILocalVariable(name: "Ui", scope: !18, file: !1, line: 34, type: !11)
!128 = !DILocalVariable(name: "Li", scope: !18, file: !1, line: 34, type: !11)
!129 = !DILocalVariable(name: "Pinv", scope: !18, file: !1, line: 34, type: !11)
!130 = !DILocalVariable(name: "Lip", scope: !18, file: !1, line: 34, type: !11)
!131 = !DILocalVariable(name: "Uip", scope: !18, file: !1, line: 34, type: !11)
!132 = !DILocalVariable(name: "Llen", scope: !18, file: !1, line: 34, type: !11)
!133 = !DILocalVariable(name: "Ulen", scope: !18, file: !1, line: 34, type: !11)
!134 = !DILocalVariable(name: "LUbx", scope: !18, file: !1, line: 35, type: !7)
!135 = !DILocalVariable(name: "LU", scope: !18, file: !1, line: 36, type: !8)
!136 = !DILocalVariable(name: "k1", scope: !18, file: !1, line: 37, type: !12)
!137 = !DILocalVariable(name: "k2", scope: !18, file: !1, line: 37, type: !12)
!138 = !DILocalVariable(name: "nk", scope: !18, file: !1, line: 37, type: !12)
!139 = !DILocalVariable(name: "k", scope: !18, file: !1, line: 37, type: !12)
!140 = !DILocalVariable(name: "block", scope: !18, file: !1, line: 37, type: !12)
!141 = !DILocalVariable(name: "oldcol", scope: !18, file: !1, line: 37, type: !12)
!142 = !DILocalVariable(name: "pend", scope: !18, file: !1, line: 37, type: !12)
!143 = !DILocalVariable(name: "oldrow", scope: !18, file: !1, line: 37, type: !12)
!144 = !DILocalVariable(name: "n", scope: !18, file: !1, line: 37, type: !12)
!145 = !DILocalVariable(name: "p", scope: !18, file: !1, line: 37, type: !12)
!146 = !DILocalVariable(name: "newrow", scope: !18, file: !1, line: 37, type: !12)
!147 = !DILocalVariable(name: "scale", scope: !18, file: !1, line: 37, type: !12)
!148 = !DILocalVariable(name: "nblocks", scope: !18, file: !1, line: 38, type: !12)
!149 = !DILocalVariable(name: "poff", scope: !18, file: !1, line: 38, type: !12)
!150 = !DILocalVariable(name: "i", scope: !18, file: !1, line: 38, type: !12)
