; ModuleID = 'klu_kernel.c'
source_filename = "klu_kernel.c"
target datalayout = "e-m:o-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-apple-macosx10.14.0"

%struct.klu_common_struct = type { double, double, double, double, double, i32, i32, i32, i32 (i32, i32*, i32*, i32*, %struct.klu_common_struct*)*, i8*, i32, i32, i32, i32, i32, i32, i32, double, double, double, double, double, i64, i64 }

; Function Attrs: nounwind ssp uwtable
define i64 @klu_kernel(i32, i32* nocapture readonly, i32* nocapture readonly, double* nocapture readonly, i32* nocapture readonly, i64, i32* nocapture, i32* nocapture, double** nocapture, double* nocapture, i32* nocapture, i32* nocapture, i32* nocapture, i32* nocapture, i32* nocapture, i32* nocapture, double* nocapture, i32* nocapture, i32* nocapture, i32* nocapture, i32* nocapture, i32, i32* nocapture readonly, double* nocapture readonly, i32* nocapture, i32* nocapture, double* nocapture, %struct.klu_common_struct*) local_unnamed_addr #0 !dbg !13 {
  %29 = alloca double, align 8
  %30 = alloca double, align 8
  %31 = alloca i32, align 4
  %32 = alloca i32, align 4
  call void @llvm.dbg.value(metadata i32 %0, metadata !58, metadata !DIExpression()), !dbg !114
  call void @llvm.dbg.value(metadata i32* %1, metadata !59, metadata !DIExpression()), !dbg !115
  call void @llvm.dbg.value(metadata i32* %2, metadata !60, metadata !DIExpression()), !dbg !116

!0 = distinct !DICompileUnit(language: DW_LANG_C99, file: !1, producer: "Apple LLVM version 10.0.0 (clang-1000.11.45.5)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !2, retainedTypes: !3)
!1 = !DIFile(filename: "klu_kernel.c", directory: "/Users/fak/Dropbox/Projects/SparsePerf/SparseSuite/SparseSuite")
!2 = !{}
!3 = !{!4, !5, !7}
!4 = !DIBasicType(name: "double", size: 64, encoding: DW_ATE_float)
!5 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !6, size: 64)
!6 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!7 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !4, size: 64)
!8 = !{i32 2, !"Dwarf Version", i32 4}
!9 = !{i32 2, !"Debug Info Version", i32 3}
!10 = !{i32 1, !"wchar_size", i32 4}
!11 = !{i32 7, !"PIC Level", i32 2}
!12 = !{!"Apple LLVM version 10.0.0 (clang-1000.11.45.5)"}
!13 = distinct !DISubprogram(name: "klu_kernel", scope: !1, file: !1, line: 648, type: !14, isLocal: false, isDefinition: true, scopeLine: 694, flags: DIFlagPrototyped, isOptimized: true, unit: !0, variables: !57)
!14 = !DISubroutineType(types: !15)
!15 = !{!16, !6, !5, !5, !7, !5, !16, !5, !5, !19, !7, !5, !5, !5, !5, !5, !5, !7, !5, !5, !5, !5, !6, !5, !7, !5, !5, !7, !23}
!16 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !17, line: 62, baseType: !18)
!17 = !DIFile(filename: "/Applications/Xcode.app/Contents/Developer/Toolchains/XcodeDefault.xctoolchain/usr/lib/clang/10.0.0/include/stddef.h", directory: "/Users/fak/Dropbox/Projects/SparsePerf/SparseSuite/SparseSuite")
!18 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!19 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !20, size: 64)
!20 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !21, size: 64)
!21 = !DIDerivedType(tag: DW_TAG_typedef, name: "Unit", file: !22, line: 253, baseType: !4)
!22 = !DIFile(filename: "./klu_version.h", directory: "/Users/fak/Dropbox/Projects/SparsePerf/SparseSuite/SparseSuite")
!23 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !24, size: 64)
!24 = !DIDerivedType(tag: DW_TAG_typedef, name: "klu_common", file: !25, line: 207, baseType: !26)
!25 = !DIFile(filename: "./klu.h", directory: "/Users/fak/Dropbox/Projects/SparsePerf/SparseSuite/SparseSuite")
!26 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "klu_common_struct", file: !25, line: 137, size: 1280, elements: !27)
!27 = !{!28, !29, !30, !31, !32, !33, !34, !35, !36, !41, !43, !44, !45, !46, !47, !48, !49, !50, !51, !52, !53, !54, !55, !56}
!28 = !DIDerivedType(tag: DW_TAG_member, name: "tol", scope: !26, file: !25, line: 144, baseType: !4, size: 64)
!29 = !DIDerivedType(tag: DW_TAG_member, name: "memgrow", scope: !26, file: !25, line: 145, baseType: !4, size: 64, offset: 64)
!30 = !DIDerivedType(tag: DW_TAG_member, name: "initmem_amd", scope: !26, file: !25, line: 146, baseType: !4, size: 64, offset: 128)
!31 = !DIDerivedType(tag: DW_TAG_member, name: "initmem", scope: !26, file: !25, line: 147, baseType: !4, size: 64, offset: 192)
!32 = !DIDerivedType(tag: DW_TAG_member, name: "maxwork", scope: !26, file: !25, line: 148, baseType: !4, size: 64, offset: 256)
!33 = !DIDerivedType(tag: DW_TAG_member, name: "btf", scope: !26, file: !25, line: 150, baseType: !6, size: 32, offset: 320)
!34 = !DIDerivedType(tag: DW_TAG_member, name: "ordering", scope: !26, file: !25, line: 151, baseType: !6, size: 32, offset: 352)
!35 = !DIDerivedType(tag: DW_TAG_member, name: "scale", scope: !26, file: !25, line: 153, baseType: !6, size: 32, offset: 384)
!36 = !DIDerivedType(tag: DW_TAG_member, name: "user_order", scope: !26, file: !25, line: 157, baseType: !37, size: 64, offset: 448)
!37 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !38, size: 64)
!38 = !DISubroutineType(types: !39)
!39 = !{!6, !6, !5, !5, !5, !40}
!40 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !26, size: 64)
!41 = !DIDerivedType(tag: DW_TAG_member, name: "user_data", scope: !26, file: !25, line: 162, baseType: !42, size: 64, offset: 512)
!42 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!43 = !DIDerivedType(tag: DW_TAG_member, name: "halt_if_singular", scope: !26, file: !25, line: 164, baseType: !6, size: 32, offset: 576)
!44 = !DIDerivedType(tag: DW_TAG_member, name: "status", scope: !26, file: !25, line: 177, baseType: !6, size: 32, offset: 608)
!45 = !DIDerivedType(tag: DW_TAG_member, name: "nrealloc", scope: !26, file: !25, line: 178, baseType: !6, size: 32, offset: 640)
!46 = !DIDerivedType(tag: DW_TAG_member, name: "structural_rank", scope: !26, file: !25, line: 180, baseType: !6, size: 32, offset: 672)
!47 = !DIDerivedType(tag: DW_TAG_member, name: "numerical_rank", scope: !26, file: !25, line: 185, baseType: !6, size: 32, offset: 704)
!48 = !DIDerivedType(tag: DW_TAG_member, name: "singular_col", scope: !26, file: !25, line: 191, baseType: !6, size: 32, offset: 736)
!49 = !DIDerivedType(tag: DW_TAG_member, name: "noffdiag", scope: !26, file: !25, line: 196, baseType: !6, size: 32, offset: 768)
!50 = !DIDerivedType(tag: DW_TAG_member, name: "flops", scope: !26, file: !25, line: 198, baseType: !4, size: 64, offset: 832)
!51 = !DIDerivedType(tag: DW_TAG_member, name: "rcond", scope: !26, file: !25, line: 199, baseType: !4, size: 64, offset: 896)
!52 = !DIDerivedType(tag: DW_TAG_member, name: "condest", scope: !26, file: !25, line: 200, baseType: !4, size: 64, offset: 960)
!53 = !DIDerivedType(tag: DW_TAG_member, name: "rgrowth", scope: !26, file: !25, line: 201, baseType: !4, size: 64, offset: 1024)
!54 = !DIDerivedType(tag: DW_TAG_member, name: "work", scope: !26, file: !25, line: 202, baseType: !4, size: 64, offset: 1088)
!55 = !DIDerivedType(tag: DW_TAG_member, name: "memusage", scope: !26, file: !25, line: 204, baseType: !16, size: 64, offset: 1152)
!56 = !DIDerivedType(tag: DW_TAG_member, name: "mempeak", scope: !26, file: !25, line: 205, baseType: !16, size: 64, offset: 1216)
!57 = !{!58, !59, !60, !61, !62, !63, !64, !65, !66, !67, !68, !69, !70, !71, !72, !73, !74, !75, !76, !77, !78, !79, !80, !81, !82, !83, !84, !85, !86, !87, !88, !89, !90, !91, !92, !93, !94, !95, !96, !97, !98, !99, !100, !101, !102, !103, !104, !105, !106, !107, !108, !109}
!58 = !DILocalVariable(name: "n", arg: 1, scope: !13, file: !1, line: 651, type: !6)
!59 = !DILocalVariable(name: "Ap", arg: 2, scope: !13, file: !1, line: 652, type: !5)
!60 = !DILocalVariable(name: "Ai", arg: 3, scope: !13, file: !1, line: 653, type: !5)
!61 = !DILocalVariable(name: "Ax", arg: 4, scope: !13, file: !1, line: 654, type: !7)
!62 = !DILocalVariable(name: "Q", arg: 5, scope: !13, file: !1, line: 655, type: !5)
!63 = !DILocalVariable(name: "lusize", arg: 6, scope: !13, file: !1, line: 656, type: !16)
!64 = !DILocalVariable(name: "Pinv", arg: 7, scope: !13, file: !1, line: 659, type: !5)
!65 = !DILocalVariable(name: "P", arg: 8, scope: !13, file: !1, line: 661, type: !5)
!66 = !DILocalVariable(name: "p_LU", arg: 9, scope: !13, file: !1, line: 663, type: !19)
!67 = !DILocalVariable(name: "Udiag", arg: 10, scope: !13, file: !1, line: 664, type: !7)
!68 = !DILocalVariable(name: "Llen", arg: 11, scope: !13, file: !1, line: 665, type: !5)
!69 = !DILocalVariable(name: "Ulen", arg: 12, scope: !13, file: !1, line: 666, type: !5)
!70 = !DILocalVariable(name: "Lip", arg: 13, scope: !13, file: !1, line: 667, type: !5)
!71 = !DILocalVariable(name: "Uip", arg: 14, scope: !13, file: !1, line: 668, type: !5)
!72 = !DILocalVariable(name: "lnz", arg: 15, scope: !13, file: !1, line: 669, type: !5)
!73 = !DILocalVariable(name: "unz", arg: 16, scope: !13, file: !1, line: 670, type: !5)
!74 = !DILocalVariable(name: "X", arg: 17, scope: !13, file: !1, line: 672, type: !7)
!75 = !DILocalVariable(name: "Stack", arg: 18, scope: !13, file: !1, line: 675, type: !5)
!76 = !DILocalVariable(name: "Flag", arg: 19, scope: !13, file: !1, line: 676, type: !5)
!77 = !DILocalVariable(name: "Ap_pos", arg: 20, scope: !13, file: !1, line: 677, type: !5)
!78 = !DILocalVariable(name: "Lpend", arg: 21, scope: !13, file: !1, line: 680, type: !5)
!79 = !DILocalVariable(name: "k1", arg: 22, scope: !13, file: !1, line: 683, type: !6)
!80 = !DILocalVariable(name: "PSinv", arg: 23, scope: !13, file: !1, line: 684, type: !5)
!81 = !DILocalVariable(name: "Rs", arg: 24, scope: !13, file: !1, line: 685, type: !7)
!82 = !DILocalVariable(name: "Offp", arg: 25, scope: !13, file: !1, line: 688, type: !5)
!83 = !DILocalVariable(name: "Offi", arg: 26, scope: !13, file: !1, line: 689, type: !5)
!84 = !DILocalVariable(name: "Offx", arg: 27, scope: !13, file: !1, line: 690, type: !7)
!85 = !DILocalVariable(name: "Common", arg: 28, scope: !13, file: !1, line: 692, type: !23)
!86 = !DILocalVariable(name: "pivot", scope: !13, file: !1, line: 695, type: !4)
!87 = !DILocalVariable(name: "abs_pivot", scope: !13, file: !1, line: 696, type: !4)
!88 = !DILocalVariable(name: "xsize", scope: !13, file: !1, line: 696, type: !4)
!89 = !DILocalVariable(name: "nunits", scope: !13, file: !1, line: 696, type: !4)
!90 = !DILocalVariable(name: "tol", scope: !13, file: !1, line: 696, type: !4)
!91 = !DILocalVariable(name: "memgrow", scope: !13, file: !1, line: 696, type: !4)
!92 = !DILocalVariable(name: "Ux", scope: !13, file: !1, line: 697, type: !7)
!93 = !DILocalVariable(name: "Li", scope: !13, file: !1, line: 698, type: !5)
!94 = !DILocalVariable(name: "Ui", scope: !13, file: !1, line: 698, type: !5)
!95 = !DILocalVariable(name: "LU", scope: !13, file: !1, line: 699, type: !20)
!96 = !DILocalVariable(name: "k", scope: !13, file: !1, line: 700, type: !6)
!97 = !DILocalVariable(name: "p", scope: !13, file: !1, line: 700, type: !6)
!98 = !DILocalVariable(name: "i", scope: !13, file: !1, line: 700, type: !6)
!99 = !DILocalVariable(name: "j", scope: !13, file: !1, line: 700, type: !6)
